{"d":"2020-08-05T11:42:39Z","t":"           Close Your Eyes\n\n\n\n","c":"Years ago my sister taught me the ‘Close Your Eyes’ game. You just need to close your eyes tightly and feel the light entering through your eyelids. Try it. Close your eyes and try to search for the silhouette of a man against the light. He'll remain in the same place even if you move your head.\n\nKeep your eyes shut and assume that you're playing a game. Think of yourself as the camera and move forward. As you near the man, you'll see him standing with his hands raised, with long fangs instead of fingers. It'll feel like he's staring back too, standing right in front of you, ignore that sensation. It'll feel like he's reaching out for your neck. Wait until you hear a low growl, then open your eyes. Have you tried it yet? Very good. Thank you.\n\nI'm sorry, I lied. You were supposed to keep your eyes closed until the man left. If you open your eyes before that, you'll see what my sister saw – that man standing right in front of you, smiling, with his lips pressed so hard that it had gone white.\n\nAfter that my sister saw the man every time she closed her eyes, getting closer each time. She even moved to another flat, but the man followed her there. One night she called me and said that the man was now inside her room. She begged me to play the game and call the man to me. She was so scared, what could have I done?\n\nSince then we've been playing the game together. I allow the man to get close to me, then call my sister to take him away. She does the same too. The same went until a week ago – she didn't call.\nThe police found her body in a lake. She'd drowned in an accident. The oddest thing was, when her body was found, her eyes were wide open with fear visible in them.\n\nSince then I'm alone with the man. He was getting closer, so I had to pass him on to someone. I'm really sorry, but it had to be someone who wouldn't suspect the story. Just pass him on to someone else before he gets too close. And even if he does, remember –\n\nDO NOT OPEN YOUR EYES.\n\n\n\n\n\n#brother #sister #game #man #eyes #haunt #death #save\n\n\n\nPicture from a collab by Spookians Club","f":"i","m":[[2066,2080]],"l":["hor","lif"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/close-your-eyes-blcq08","p":"bk77jw","n":"blgiwt"}