{"d":"2023-06-20T07:15:16Z","t":"The boy sat at the kitchen table, his small frame barely visible because of how lonely he felt. His mother, seated across from him, held a glass of wine, her eyes distant and unfocused. Wanting to connect with her, he gathered his courage and spoke up.\n\n                                                    cont...","c":"“Mom,” he started quietly, his voice almost drowned out by the sound of glasses clinking. “Can we talk?”\n\nHis mom glanced at him briefly, but then her attention went back to her drink. “Not now, sweetie,” she replied, sounding a bit drunk. “Go talk to your dad. He's in the study.”\n\nFeeling ignored and pushed away, the boy went to the study where his dad was sitting at his desk covered in papers. The room was lit by a single lamp, casting long shadows on the worn carpet. The boy hesitated at the door, unsure of how to approach his busy father.\n\n“Dad,” he whispered tentatively. “Can we talk?”\n\nHis dad looked up from his work, looking tired. “I'm sorry, son,” he sighed, his voice strained. “I'm really busy right now. We can talk later, okay?”\n\nThe boy nodded silently and went back to his room, a familiar heaviness settling upon his shoulders. He closed the door, shutting out the world and sinking into his own loneliness. Feeling sad and isolated, he wondered why it was so hard for him to connect with others.\n\nAt school, he tried to stay quiet and blend in, hoping to avoid trouble. But a group of girls took pleasure in targeting him with mean words and cruel pranks. Their insults hurt him deeply, leaving invisible scars that nobody could see.\n\n“Why do people always pick on me?” the boy thought, tears filling his eyes. “I don't want trouble. I just want to be left alone.”\n\nFeeling like he didn't exist, he couldn't understand why others wanted to disrupt his fragile peace. The bullying hurt him a lot, but he learned to keep the pain inside, not wanting to burden anyone else with his struggles.\n\nHe wished someone would listen and understand the pain he carried inside. But the walls around him seemed to grow taller, his parents too caught up in their own problems to notice the silent suffering he endured.\n\n\n\n#fragments_by_sd #bullying #alone #busy\n\nWelcome to the day 22 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #thebadlistener. Post longer stories in the caption. No word limit. No language bar. Post in any language. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2141,2155]],"l":["sto","lif"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/boy-sat-kitchen-table-his-small-frame-barely-visible-because-crgm2f","p":"crgc87","n":"crgyni"}