{"d":"2023-06-25T07:23:34Z","t":"Once again, it was the boy's birthday, but just like before, it was a quiet and unexciting day. Each year, the occasion seemed less important. He sat alone in his room, feeling the silence all around him, and wondered why there was no excitement or celebration in his life.\n\n                                                    cont...","c":"Being a shy and quiet kid, the boy always had trouble making friends. There were a few who called themselves friend, but when he invited them to his birthday, they politely made excuses or didn't respond at all. His birthdays reminded him of his loneliness, confirming that he struggled to make meaningful connections with others.\n\nThe boy's parents were always busy with their own lives, leaving him feeling unseen and neglected. It seemed like they didn't even notice he existed. His birthdays came and went without any recognition or celebration from them. He often wished for caring parents who would throw him a party or simply spend quality time with him on his special day.\n\nHowever, there was one person who brightened his life in the midst of his loneliness—a girl, his only friend. They had a special bond that went beyond words. They were like soulmates, always there for each other. But his parents seemed unaware of her existence too. To them, she was like a ghost, invisible. The girl understood the pain of being forgotten and ignored too.\n\n---\n\nMoving to a new place brought unexpected changes to my life. One of the most significant changes was my relationship with my father. In our old home, he was always distant, focused on his work and not really listening to me. But after the move, something changed. Suddenly, he seemed genuinely interested in what I had to say, eager to have conversations and spend time with me.\n\nBecause of this, my birthdays became really special. My dad made an effort to plan surprises and make it a memorable day. He asked me about my favorite things, what gifts I dreamt of, and made sure my birthday was filled with joy. Our new home turned into a place of celebration, full of excitement.\n\nHowever, there was one person who didn't change during this time: my mother. She had always been distant and struggled with alcoholism. She rarely showed up for my birthdays, usually lost in a haze of drinking, disconnected from reality. It was disheartening to see her stumbling through the house, her mind clouded and her movements unsteady.\n\nThen, on one of my birthdays, my mom's drinking reached a new level. She fell down the stairs, the noise echoed through the house. I rushed to her, but amidst the chaos, I couldn't help feeling resigned. The years of neglect and missed opportunities for connection had taken their toll. My mother's tragic end felt like the result of a broken relationship, the final act in a story of unfulfilled expectations and shattered dreams.\n\n\n\n#fragments_by_sd #alone #death #celebration\n\nWelcome to the day 27 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #thebirthdayboy. Post longer stories in the caption. No word limit. No language bar. Post in any language. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2835,2849]],"l":["sto","lif"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/once-again-it-boy-s-birthday-just-like-before-it-quiet-day-crh5ak","p":"crhtx5","n":"cridu6"}