{"d":"2023-06-28T07:16:13Z","t":"I had been observing him in the park for a few days, noticing how he tried to talk to the girl named Jasmine but seemed scared and unsure. He had a strong feeling of fear and nervousness within him, like he was burdened with a thousand insecurities. He had always acted this way, stuck in his own shyness.\n\n                                                          cont...","c":"He was always so afraid, even during that unfortunate incident on the school rooftop twenty-three years ago. I remembered that day vividly, the accident that occurred. Although I wouldn't call it an accident. It was intentional, and I must admit, I took pleasure in it. The memory still brought me great satisfaction.\n\nBy a stroke of luck, I found out that a house next to his was available for rent. I quickly moved in, pretending to be Dr. Shelly. I even got a cat to make it seem more authentic, although I didn't really like cats. It was all part of my plan to establish a connection.\n\nWith my presence established, I focused on Jasmine. It was surprisingly easy for me to start talking to her. We spent time together, mostly discussing flowers. He would just watch her from a distance, his fear growing each day. Slowly, Jasmine and I formed a bond as friends, sharing secrets and stories. She became comfortable around me, and eventually, I invited her to my house.\n\nDuring that fateful visit, Jasmine's curiosity led her to discover my study. She stumbled upon my collection of notes and photos, all about her. She panicked and wanted to leave, realizing the extent of my obsession. It broke my heart, knowing I had made a terrible mistake.\n\nIn the chaos that followed, I couldn't control my emotions, and ended up doing something terrible and irreversible. I couldn't bear the thought of her walking away. My anger took over, and I ended up choking Jasmine until she was dead. It wasn't the first time I had done something so terrible, but losing her, realizing that I had pushed her away forever, tore me apart.\n\nKnowing the seriousness of what I had done, I knew I had to disappear. I quickly tried to hide any evidence of my actions, planning to make it seem like I had vanished. I left a note signed as \"Shelly,\" asking for help with the cat, hoping it would distract him. And just like that, I disappeared into the shadows.\n\n\n\n#fragments_by_sd #stalking #curiosity #murder\n\nWelcome to the day 30 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #thebreakup. Post longer stories in the caption. No word limit. No language bar. Post in any language. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2251,2265]],"l":["sto","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-had-been-observing-him-park-few-days-noticing-how-tried-cri2er","p":"crirhn","n":"crjdi0"}