{"d":"2023-06-27T07:34:00Z","t":"I sat down on the dirty floor, holding the old diary in my lap. It looked really old, with a worn cover and yellowed, delicate pages. I started turning the pages carefully, they were torn and had holes from moths. The writing on them was faded and hard to read, and some parts I couldn't understand at all. But I could still make out a few things here and there. As I read the bits and pieces, memories from the past started coming back to me, like faint whispers from a long time ago.\n                                                                 cont...","c":"Aug 13, 1999\nTodey is my brthday, but it's rlly sad. Nobady remembers, not even my dad. Last year, he gave me u, my special dairy, and I thoght he wud remember this time. But it's ok becos I have u now, Dairy! Ur my gift! I'll rite in u from todey, and u'll alwys remember my special days. We'll have so much fun together! Mayb 1 day, sumone will remember my brthday too.\n\nSep 7, 1999\nSchool was tuf again todey. The other kids bother me and they say they're my frends, but I know they're not. It makes me feel sad and cofused. Y can't they be nice? I wish I had real frends who would stand up for me and make me happy. Maybe one day I'll find frends who trly care about me and treat me kindly.\n\nOct 4, 1999\nTudey was yuky. Those mean girls teased me again and called me silly names. It made me super sad. I wanted to tel my mom and dad, but they're alwys so bizy and don't have time to listen. I wish they cud understand how much it hurts. I hope tomorrow is a beter day, and sumone will be there to make me feel beter.\n\nOct 28, 1999\nGess wat? Somthing strange happened at the playgrond todey. I was all by myself, feeling lonli, when this girl named Shelly came up to me. She said she wanted to be my frend, but I'm not sure if I shud beliv her. People have said things before and then disapird. I hope Shelly is difernt, but I'll kepe an i out just in case. Mayb, just mayb, I've found a real frend.\n\nNov 22, 1999\nToday was rlly tuf. Wen I came back from school, ther was no food for me to eat. Mom was feling funny becos she had to much to drink, so she cudn't cook. It made me sad and hngry. Shelly came to see me. She told me that evrything will be ok. Even tho my mom didn't even notis her, it made me feel beter to no that Shelly caers.\n\nDec 18, 1999\nChrismas is geting closer, and I feel a litle sad. My parents are alwys beze, and I wish they cud be here with me. I hope Santa can bring me loving parents who have time for me and frends who will be there wen I nead them. Maybe, just maybe, Chrismas magic can make it hapen. Fingers crost!\n\nJan 1, 2000\nHappy New Year! Today, I made a special promis to myself. I decided that this year, I won't let the bullys push me around anymor. My resolutin is to be brve and stand up for myself. I think I wil talk to my teechers about wat's happening. They are ther to help, rite? This is going to be my year to be brave!\n\nJan 10, 2000\nI finaly got the corage to talk to my techer about the bullys, but she didn't do anyting to stop them. It made me even sader. And to make things wors, the mean girls saw me crying, and now they're calling me a crybaby. It's not fair! I just want to be treated kindly.\n\nJan 24, 2000\nI'm sory I cudn't rite for the past few days. Somting rlly scary happened to me. The mean girls cornerd me on the school roftop, and evryting became a blur. The next thing I remember is seeing blod on the ground. I think I saw Shelly there too. I was so fritend. I'm rlly scard, Dairy.\n\nJan 31, 2000\nI can't go to school anymor, but honestly, I don't want to go anyway. The naybors look at me weird, like somting is wrong with me. My parents say we have to leave.\n\n\n\n#fragments_by_sd #memories #bullying #accident\n\nWelcome to the day 29 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #accidentalfortune. Post longer stories in the caption. No word limit. No language bar. Post in any language. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[3454,3468]],"l":["sto","dia"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-sat-down-dirty-floor-holding-old-diary-my-lap-it-looked-i-crirhn","p":"cridu6","n":"cri2er"}