{"d":"2023-06-29T06:41:36Z","t":"I sat there feeling confused, surrounded by broken memories from my childhood. As I tried to make sense of it all, I heard a loud police siren that cut through the silence. It startled me, and I quickly looked towards the door. My heart raced as the door swung open with a loud crash.\n\n                                                    cont...","c":"Police officers rushed into the room, looking serious and determined. One of them said, \"You are under arrest.\" The words echoed in my ears, filling me with fear. I couldn't understand what was happening. \"Wait, I don't understand,\" I said nervously. My voice trembled as I asked, \"What have I done?\"\n\n---\n\nPolice Report\nCase Number: 2023-31199\nDate: Jun 29, 2023\n\nIncident Summary:\nThis report pertains to the murder of the victim, Jasmine, and the subsequent investigation into the suspect. Based on the information gathered, the following details have been established:\n\n1. Suspicion and Initial Findings:\nWitnesses at the park reported observing Jasmine in conversation with the assailant. These accounts raised initial suspicions regarding the suspect's involvement in the crime. Additionally, the suspect claimed that the neighbor, Shelly, was the perpetrator, as he was seen visiting her residence. However, no other neighbors reported witnessing any interaction between the suspect and Shelly.\n\n2. Dissociative Identity Disorder:\nThe suspect has been diagnosed with dissociative identity disorder (DID), displaying at least one additional personality identified as Dr. Shelly Cooke. With the assistance of a psychiatrist, we have been able to communicate with both personalities. The original personality possesses limited knowledge about the Shelly personality, while Shelly is well-informed about the original personality's life. A collection of diaries found at Shelly's residence provided documentation of the suspect's life.\n\n3. Previous Criminal Activity:\nInvestigations have revealed that the suspect has a history of criminal behavior. The suspect experienced a troubled childhood and was subjected to bullying at school. The emergence of the Shelly personality, an imaginary friend and protector, served as a coping mechanism. While the suspect tends to be introverted, the Shelly personality exhibits more extroverted traits.\n\n4. School Incidence:\nInterviews with the suspect's former classmates have shed light on a prior incident. Approximately 23 years ago, the suspect was cornered by a group of girls on the school rooftop, during which the Shelly personality surfaced. According to Shelly, she pushed one of the girls involved in bullying the suspect from the school rooftop, resulting in her death. This incident was covered up by the school administration at the time.\n\n5. Maternal Incident:\nThe Shelly personality has also admitted to pushing the suspect's mother down the stairs. The suspect's mother was frequently absent, leading to feelings of neglect. However, the incident was previously considered an accidental fall caused by the mother's intoxicated state, and no further investigation took place.\n\n6. Jasmine's Murder:\nAccording to the Shelly personality's account, she had been planning to set up Jasmine romantically with the suspect. However, what Shelly refers to as an accident led to Jasmine's death.\n\nInvestigation Progress and Further Actions:\nBased on the evidence and statements obtained during the investigation, it is evident that the suspect, with dissociative identity disorder, bears responsibility for the murder of Jasmine. The suspect's alter ego, the Shelly personality, played a significant role in the series of events that led to the victim's demise.\n\nGiven the complex nature of the suspect's mental health condition and the multiple personalities involved, it is recommended that the suspect undergoes further psychiatric evaluation and assessment to determine the appropriate course of legal action. The diaries found at Shelly's residence should be preserved as crucial evidence for the ongoing investigation.\n\n\n\n#fragments_by_sd #arrested #revelation #crime\n\nWelcome to the day 31 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #theend. Post longer stories in the caption. No word limit. No language bar. Post in any language. \n\nHope you enjoyed writing a story each day. See you on the other side. :) #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[4058,4072]],"l":["sto","hor"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-sat-there-feeling-confused-surrounded-broken-memories-my-i-crjdi0","p":"cri2er","n":"crjn0m"}