{"d":"2024-01-10T17:51:21Z","t":"Love Bites - And Bites Back\n\n\nHere I am, sitting alone in this upscale restaurant. The atmosphere is a bit overwhelming, making me feel somewhat out of place. The aroma of the food wafts through the air, mingling with the soft murmur of conversations and the clinking of cutlery.\n\n\n                                cont...","c":"Here I am, sitting alone in this upscale restaurant. The atmosphere is a bit overwhelming, making me feel somewhat out of place. The aroma of the food wafts through the air, mingling with the soft murmur of conversations and the clinking of cutlery.\n\nJust beside me, there's a table occupied by three beautiful girls. They're engaged in an enthusiastic conversation, their laughter and chatter adding to the lively ambiance of the restaurant. Their table is laden with a variety of dishes, a testament to their hearty appetite. The sight of the food makes my mouth water.\n\nOn their table, there are three plates of noodles, a dish of butter chicken, and some naan. Each of them also has a plate of biryani in front of them. One of the girls has ordered a salad as well. They each have a glass of a drink, the name of which I don't know. The vibrant colors of the drinks add to the visual feast.\n\nAs I continue to sit there, I watch them order dessert. It's some kind of cake that looks absolutely delicious. I sneak a peek at the menu and find that one piece of that cake costs 500. The price makes me gulp, but they seem unfazed. Their enthusiasm doesn't dim, and I can't help but admire their carefree spirit.\n\nI've never eaten in a fancy place like this before. I didn't know things could cost so much. I looked at the menu and checked what the girls ordered. Their bill was over 10,000! I couldn't believe it. They're spending more in one meal than I get for a whole month as pocket money.\n\nMy order, a simple cup of coffee, had just arrived. Even this small cup of coffee cost 250. I could have had four hearty meals with this amount. I took a sip of the coffee. It was good, but the price still made me wince.\n\nI turned my attention back to the girls. One of them, the one in the backless black dress, was checking her watch. She looked up at her friends and said, “He told me he'll be here in about 10-15 minutes.” She paused for a moment before adding, “And he said he'll be wearing a blue shirt.”\n\nAnother girl, this one in a full-sleeved white dress, turned to the girl in the black dress. “What's his name?” she asked, her voice was soft, almost as if she was afraid to disrupt the scene unfolding before her.\n\nFrom their conversation, I realized that it was the first time the girl in the black dress was meeting the boy. They had connected on Facebook, of all places. So, this girl and the boy were the main characters of the story. The anticipation was palpable, and I found myself drawn into their narrative, curious to see how it would unfold. I took another sip of my coffee.\n\nThe girl in the backless black dress, now known as Backless, looked at the girl in the white dress and said, “His name is Rakesh.”\n\nThe third girl, dressed in a black half-sleeve dress, chimed in. She turned to Backless and asked, “So, tell us more about how you two met? And what does he do?”\n\nBackless gave a small laugh before she began, “Well, we first connected on Facebook. He's a student, came to Kolkata for his college. Lives in a hostel. He's... well, he's kind of naive. I honestly don't think he's ever really talked to a girl before, let alone been in love.” She shrugged, a small smile playing on her lips as she shared their story.\n\nThe girl in the full-sleeved white dress, now known as Full Sleeve, clapped her hands together in excitement. “We're going to have a great feast today!” she exclaimed, her eyes sparkling with anticipation.\n\nBackless nodded, a mischievous glint in her eyes. “That's exactly why I brought you two here,” she said, her voice low and conspiratorial. “We're going to have some fun with that stupid Rakesh.” The room filled with their laughter, the story taking an unexpected turn. The stage was set for an interesting evening.\n\nThe third girl, now known as Half Sleeve, asked, “Does this boy have money, or is he poor?”\n\nBackless shrugged nonchalantly, “What do I care? He said he loves me, and I said the same. I told him that if he truly loves me, we will eat out regularly. Love isn't cheap, after all.” She paused for a moment, a smirk playing on her lips. “That fool, I said ‘I love you’ and he has fallen head over heels in love.”\n\nFull Sleeve wondered aloud, “I wonder how the boy will react when he sees our massive order! Does he even have enough money to cover it?”\n\nBackless smiled wickedly, “I have told him that I like dining out. I'll eat to my heart's content today, so I've asked him to be generous. He won't dare to say no, or he'll lose me forever.” She took a sip of her drink, and chuckled softly. The girls couldn't help but join in her laughter.\n\nFull Sleeve shook her head, “Such a gullible boy.”\n\nBackless frowned at her phone, “He isn't replying to my messages. He always replies instantly, but he isn't replying right now.” She clenched her fist, her eyes flashing with determination. “Let him come, I'll show him what happens when he ignores me.”\n\nHalf Sleeve glanced at the empty chair. “He's not here yet, but the food is,” she said, her voice echoing the uneasiness of the situation.\n\nBackless' face was a storm of emotions - annoyance, uncertainty, and anger. “I've been with many guys, but none have ever kept me waiting this long. He's over an hour late. I just don't get it,” she grumbled, her voice laced with frustration. Her eyes hardened as she added, “I feel like giving him a piece of my mind.”\n\nFull Sleeve looked at her friends. “We've nearly finished the food. Who's going to settle the bill? We ordered all this to trick him. I'm broke,” she confessed, her voice barely a whisper. Their laughter had faded, replaced by a tense anticipation for the boy who was yet to show up.\n\nI had already finished my coffee, having watched the drama unfold from a distance. I paid my bill, left a small tip for the waiter, and walked out of the restaurant, whistling a cheerful tune. I had arrived an hour early, dressed in a sleek black shirt, hoping to surprise her.\n\nOnce outside, I pulled out my phone and opened Facebook. I navigated to Backless' profile and hit the block button. A smile tugged at the corners of my lips as I pocketed my phone. The small price of the coffee was a worthy trade-off for the satisfaction I felt. I walked away, leaving the restaurant and its drama behind.\n\n\n\n#drama #romance #deception #restaurant #anticipation #revenge #fakelove #satisfaction","f":"i","l":["lif","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/love-bites-bites-back-here-i-sitting-alone-this-upscale-bit-cs0pdv","p":"cszt8j","n":"cs1ty0"}