{"d":"2024-02-06T20:03:04Z","t":"Detour 3\n...\nAnd then, breaking the silence, came a loud, blood-curdling scream from the direction of the forest. I stood there, frozen, as the echo of the scream faded into the night.\n\n\nI managed to close the window, shutting out the night and the scream. I glanced at the kids on their beds, wondering how they could sleep through such a noise. I crawled back into my bed and pulled the mosquito net over me.","c":"#detour_by_sd\n\nI managed to close the window, shutting out the night and the scream. I glanced at the kids on their beds, wondering how they could sleep through such a noise. I crawled back into my bed and pulled the mosquito net over me. The crickets had resumed their chirping, but the silence felt heavy and oppressive. I tried to sleep, but I couldn't. I was too scared and curious about the source of the scream. What could it be? A wild animal? A human in distress? I tossed and turned, hoping it wouldn't happen again. It was only in the early hours of the morning that I finally drifted off to sleep.\n\nI woke up to the sound of the household bustling with activity. I sat up on the bed, feeling groggy and sore. A dull pain shot through my back and waist, making me wince. I realized the long journey and the bumpy bus ride had taken a toll on my body. I lay back down, finding temporary relief in the flat surface of the bed.\n\nTanisha came into the room a few minutes later. She smiled and greeted me. “Good morning, sleepyhead. You're still in bed? Come on, get up. We're going to see the village today. It'll be fun.”\n\n“I'm not feeling well,” I replied, grimacing as another wave of pain washed over me. “My back is killing me. I think the journey here was too much.”\n\nTanisha looked at me with sympathy. “Oh, you poor thing,” she said. “You must be in a lot of pain. Don't worry, I'll get you some medicine.” She turned to leave, but I grabbed her hand and stopped her.\n\nShe looked at me with a mix of surprise and annoyance. “What are you doing?” she whispered. “Someone might see us.”\n\nI let go of her hand and shook my head. “I'm not trying to be romantic, Tanisha. I need to tell you something that happened last night.” She frowned and leaned closer to me. “What is it? What happened?”\n\nI took a deep breath and told her about the scream I had heard in the night - the loud, piercing, terrifying scream. She listened to me with wide eyes and a puzzled expression. “A scream?” she repeated. “Are you sure? I didn't hear anything. You must have been dreaming, or maybe hallucinating. You know how tired you were after the journey.”\n\nI shook my head again. “No, Tanisha. I'm not making this up. I heard it. It was real. And it was not a dream. It was too loud, too clear. It was like someone was being tortured, or killed. It was horrible.”\n\nShe bit her lip and looked around nervously. “If there was a sound, it was probably just a wild animal. There are lots of elephants in the jungle around here. It could have been them.”\n\nI wasn't convinced, but I didn't want to argue. “Alright,” I said, trying to sound convinced. “Just get me the medicine, please.” She smiled and kissed me on the cheek. Then she got up and left the room.\n\nA little while later, the old lady who had greeted us when we arrived came into the room. She was carrying a small bowl filled with a brown, oily liquid. The smell was strong and earthy, filling the room with its pungency.\n\n“Tanisha told me about your back pain,” she said, her voice soft and soothing. “This oil will help. It's a family recipe, much better than the medicines you city folks use.”\n\nShe asked me to take off my shirt and lie on my stomach. I hesitated, feeling a bit shy. But she reassured me, saying, “Don't worry, dear. I'm like a grandmother to you.”\n\nSo, I did as she asked, lying face down on the bed. She began to massage my back with the oil, her hands strong and sure. As she worked, she started talking about her family. I learned that she was Tanisha's grandmother's sister-in-law. Her husband had passed away, and she was now the eldest member of the family, the last of her generation.\n\nNot long after, Tanisha walked into the room and sat down on the edge of my bed. She looked at me with concern in her eyes. “How are you feeling now?” she asked.\n\nI took a moment to assess my condition. The tension in my back had lessened considerably. The pain was still there, but it was duller, more manageable. “I'm feeling better,” I told her. “The pain isn't as bad as before.”\n\nTanisha nodded, looking relieved. “That's good to hear,” she said. “We don't need to go out today. We have plenty of holidays left. You should rest.”\n\nBy then, the old lady had finished massaging my back. She wiped her hands on her cloth and stood up. “You'll feel much better now,” she said, her voice confident. “Come down and have breakfast when you're ready.”\n\nWith Tanisha's help, I tried to get up. To my surprise, I didn't feel any pain. I thanked the old lady, who smiled and left the room. After freshening up and putting on my shirt, I went downstairs for breakfast, feeling grateful for the kindness and care I had received.\n\nWhen I reached the dining room, I saw that most of the family had already eaten their breakfast. Tanisha served me a plate of idlis and vadas, along with some other dishes that I didn't recognize. I was not a fan of South Indian food, but I had to admit that this was the best I had ever tasted. I wished I had tried this kind of food earlier, maybe I would have liked it more.\n\nAfter breakfast, I had some time to chat with Tanisha and get to know her family better. It was strange that we hadn't had a chance to do that since we arrived here yesterday. It appeared that some of the men in the family had already left for work. The women were busy with household chores, but they took the time to introduce themselves. I had already met her grandmother, who had massaged my back. She also had five aunts, who greeted me warmly.\n\nThen I met her two uncles, who were at home. Two more were working outside. She also had eight cousins, three of whom were kids. And she had two nieces and a nephew, who were adorable. It was a big and happy family. I saw the six kids playing in the yard; I had talked to them yesterday. They seemed to like me a lot.\n\nThe remainder of the day was quite uneventful. We had lunch and dinner at the usual times, and I found myself enjoying their local cuisine more with each meal. It was a pleasant change from my usual fare.\n\nDuring dinner, it was decided that if I was feeling better the next day, we would visit an ancient king's palace. I was told that there were many legends about the king, and I was eager to hear them. The thought of exploring the palace and learning about its history excited me. With these thoughts in my mind, I went to bed and had a peaceful sleep, undisturbed by any sounds or discomforts.\n\nAs the sun began to rise the next morning, we set out for the palace. Tanisha had prepared some food for us, and Adithan was at the wheel. The drive was short, only about half an hour, and the palace was in the opposite direction from where we had come.\n\nAdithan turned to us, “Not many folks know about this place,” he said, “So it's not really a tourist spot.” He parked the car at what seemed like a dead end. He seemed to know these parts well.\n\nBefore us stood a large, imposing structure. It loomed in the early morning light, a silent testament to a bygone era. We followed Adithan through a narrow gate, ducking under vines that hung from the crumbling walls.\n\nThe palace was a maze of cracked pillars, faded frescoes, and broken statues. It was a shadow of its former glory, but there was a certain beauty in its decay. The air was heavy with dust and the smell of old stone. Our footsteps echoed in the silence, the only sound in this forgotten place.\n\nWe wandered through the palace, marveling at its intricate details. Adithan was our guide, telling us stories about its past. “The last king of Pirathukulam was Kasinhavairaman,” he said, as we entered a large hall with a throne at the end. “This palace was built by his ancestors, who ruled this land for generations. He was a good king, but he had a problem. He had no children to inherit his throne.”\n\nWe looked around the hall, noticing the portraits of the royal family on the walls. The colors were faded, the details were blurred, and some parts were missing or torn. The last portrait was of a young boy. “That's his son,” Adithan continued. “He was born after many years of prayers and sacrifices. The king was overjoyed, and he built the temple in the jungle on the other side of the village. He named his son Rajavairaman, meaning 'the king of kings'.”\n\n“What happened to him?” I asked. Adithan sighed. “He never got to be king. His father was killed by his own people. The prince was only seven years old then. His mother escaped with him and they never came back. The kingdom was taken over by several landowning overlords, who fought among themselves for power. The palace was abandoned, and the people forgot about their royal lineage.”\n\nThe story of the king and his son was a sad one, indeed. After exploring the palace and learning about its history, we returned home. That night, as we sat down for dinner, Tanisha brought up a new idea. “Why don't we visit the temple tomorrow?” she suggested, her eyes sparkling with excitement.\n\nI was quiet, still lost in the stories of the past. But the elders shook their heads. “No,” they said firmly. “You shouldn't go out tomorrow.”\n\nTanisha looked surprised. “Why not?” she asked, her curiosity piqued.\n\nThe elders exchanged a glance before answering. “Tomorrow, everything will be closed,” they explained. “The local Koligaru tribe is having a festival. It's not safe to go out.”\n\n\n\nThis is getting too stretched out. Still, to be continued...\n\n\n#mystery #culture #history #adventure #family #travel #heritage","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/detour-3-breaking-silence-came-loud-blood-curdling-scream-i-cs746u","p":"cs7aur","n":"cs8q9h"}