{"d":"2024-02-08T20:18:26Z","t":"Detour 4 (end)\n...\nThe elders exchanged a glance before answering. “Tomorrow, everything will be closed,” they explained. “The local Koligaru tribe is having a festival. It’s not safe to go out.”\n\n\n“But why?” Tanisha asked, trying to understand their reasoning. The elders were firm. “No arguments, Tanisha. You can go out the day after tomorrow.”\n","c":"#detour_by_sd\n\n“But why?” Tanisha asked, trying to understand their reasoning. The elders were firm. “No arguments, Tanisha. You can go out the day after tomorrow.” That was it. The discussion was over. I felt awkward, my ears burning with embarrassment. After dinner, we all went to our rooms.\n\nThe next day, I woke up and joined everyone for breakfast. After that, everyone got busy with their own work. Tanisha pulled me aside. She had a mischievous glint in her eyes. “Let's go out anyway,” she suggested. I was taken aback. “But we were told not to,” I reminded her.\n\nShe shrugged. “I'm curious. We won't go far. And in this big house, no one will even notice we're gone.” I couldn't deny that I was curious too. The strange happenings and the secrets were starting to get to me. After thinking for a while, I finally agreed.\n\nQuietly, we slipped out of the house and got into the jeep. I was behind the wheel, and Tanisha was navigating. The house was so big and everyone was so busy, no one noticed our absence. I drove onto the main road and then towards the jungle. The elders were right. All the shops were closed, the roads were deserted. It was as if the whole town had disappeared. What was going on with these people?\n\nAs we got closer to the lake, Tanisha made a suggestion. “Let's go to the other side of the lake,” she said. I was hesitant. “We're already too far. We should head back,” I replied. But Tanisha was persistent. “We should at least visit the temple. That's what we wanted to do. And maybe we can check out the tribe's festival too,” she said. I was reluctant, but her curiosity was infectious. Finally, I agreed.\n\nI took the wheel of the jeep and started driving across the dry lake bed, following the same path that Adithan had shown us. I wasn't very experienced in driving on such uneven terrain, but I managed to keep the jeep steady. As we reached the middle of the lake, the jeep suddenly stopped. I pressed the accelerator, the engine roared, but the jeep didn't move. I looked back and saw the back wheel spinning in place. Then I felt it, and so did Tanisha. The jeep was slowly tilting to one side. I quickly turned off the engine, and we both rushed out of the jeep and made our way to the edge of the lake.\n\nFrom there, we could see the jeep, tilting and sinking slowly into the dry ground. We had driven this way before, so what had happened now? Then it hit me - it was quicksand. I had heard about it, but I always thought it was a myth. But here we were, our jeep stuck in quicksand. We were lucky to have gotten out when we did. Now, we had to figure out what to do next.\n\nWe stood there, flustered and terrified, unsure of what to do next. “We should probably call home,” I suggested, my voice shaky. “This is what happens when you sneak out,” I added. Tanisha nodded, her eyes filled with worry. She took out her phone and dialed her uncle's number, but the call wouldn't connect. We looked at her phone screen, and it showed no network.\n\nI quickly pulled out my phone. It showed only one bar of signal, but it was worth a try. I dialed her uncle's number, and to our relief, the call connected. But all we could hear from the other side was a broken, unintelligible voice. I tried to explain our situation, but the network was too weak, and the call dropped.\n\nWe tried to call home again and again, but it was no use. We were so engrossed in our phones and our worries that we didn't notice the procession until it was almost upon us. It was only when we heard the grunts of animals and the sound of footsteps that we finally looked up.\n\nWhat we saw took our breath away. A man, dressed in royal attire, was seated on an elephant, heading towards us. There was something familiar about him, but I couldn't quite place it. The elephant he was riding was adorned with similar royal ornaments, making it a majestic sight. Behind him, more elephants followed, each carrying people. Further back, there were people on horses. At the front and sides of the procession, there were several people who looked like soldiers, their faces stern and serious.\n\nDespite our predicament, we couldn't help but be awed by the sight. It was clear that they were in a festive mood, their faces bright and cheerful. For a moment, our worries were forgotten as we watched the procession approach.\n\nAs the procession neared us, the man who looked like a king raised his hand, and everyone came to a halt. A soldier who was at the front approached us and said something. It sounded like Tamil, but I couldn't understand what he was saying. I turned to Tanisha, who was better at the language, for help. “He wants us to bow to the king,” she explained. We quickly did as we were told.\n\nThe king then spoke in the same dialect. Tanisha listened carefully, then turned to me. “It seems to be some ancient Tamil dialect,” she said. “The king is asking where we're from.”\n\n“Bangalore,” I replied.\n\nThe king responded, and Tanisha translated his words. “That must be a far-off place. I'm not aware of it. So, what brings you here?” he asked. Tanisha quickly explained our situation to him, hoping he would understand.\n\nThe king pointed towards our sinking jeep in the middle of the lake. “Is that your carriage?” he asked, his voice filled with curiosity. “How small it is! How do you ride it? And where are your elephants or horses?”\n\nWe exchanged glances, unsure of how to respond. The concept of a jeep as a carriage was strange to us. But before we could answer, the king gestured to his soldiers. They understood his silent command and directed two elephants towards the lake.\n\nThe elephants lumbered down to the lake, their massive bodies moving with surprising grace. They reached the jeep and effortlessly pulled it out of the quicksand. With the jeep secured, they brought it back and placed it next to us before rejoining the procession.\n\n“Be careful,” the king advised us, his voice soft but firm. He then raised his hand, as if to bless us, and the procession moved on.\n\nWe watched the procession disappear into the jungle, our eyes wide with awe. The sight of the king, the elephants, and the soldiers was mesmerizing. But the ringing of Tanisha's phone brought us back to reality. It was her uncle. She quickly picked up the call and started explaining our situation. I glanced at my phone and saw that it had full signal now.\n\nAfter a short conversation, Tanisha hung up the phone and turned to me. “We have been asked to go back home,” she said, her voice filled with worry. “My uncle is angry.” Without wasting any time, we quickly got into the jeep and started our journey back home.\n\nAs we pulled up to the house, we saw Tanisha's family waiting for us. Her uncles, aunts, and even her old grandmother were standing outside. We got out of the jeep and one of her uncles stepped forward. “After your call got cut off, we started looking for you,” he said. “We couldn't reach you on your phones. We were worried. Finally, we managed to connect with Tanisha.”\n\nOn the other hand, Tanisha's aunt was scolding her. “How could you go out, Tanisha?” she asked. “And why did you take him with you? We've told you not to go out. He might be a stranger to our ways, but you're not.”\n\nJust then, Adithan returned with a man who looked like a priest. The priest had a calm, prepared look about him. He whispered a prayer, then marked our foreheads with sandalwood paste. He tied a thread bracelet around our wrists. “This will protect you,” he said.\n\n“Go inside and freshen up,” Tanisha's uncle said, ending the conversation. We nodded and headed inside. Despite the scolding and the worry, it felt good to be home.\n\nThat night, Tanisha's uncles and her old grandmother sat us down for a talk. They wanted to make sure we understood everything, so we wouldn't make the same mistake again.\n\nThe story starts about 150 years ago. Back then, Pirathukulam was a kingdom under the rule of King Kasinhavairaman. It was a vast and prosperous kingdom, much larger than it is now, encompassing several of the nearby villages we see today. But despite his wealth and power, the king was troubled. He had no children, no one to inherit his throne.\n\nConcerned about the future of his kingdom, the king decided to take a second wife. However, this decision didn't sit well with the first queen. She felt neglected as the king's attention shifted towards the young queen. She was worried that if the young queen bore a son, her own status would diminish and the son would become the heir to the throne.\n\nBut as fate would have it, even after several attempts, the young queen was unable to conceive. This turn of events worked in favor of the first queen, but it left the king and his kingdom in a state of uncertainty.\n\nIn his desperation, King Kasinhavairaman sought help from every corner of his kingdom and beyond. He consulted with numerous physicians and healers, hoping they could provide a solution. He offered prayers to the gods, provided food for the poor, sought advice from saints and monks, and even performed yajnas. But despite all his efforts, nothing seemed to work. \n\nThe king's plight was felt by the people of his kingdom. They watched as their ruler, once so powerful and confident, was brought to his knees by his personal predicament. In his desperation, the king even turned to black magic, but that too failed to provide the desired result.\n\nJust when all hope seemed lost, a tantrik, a practitioner of mystical arts, visited the king. He suggested a drastic solution - to gain a new life, the king had to give a life. He proposed a human sacrifice.\n\nAt his wits' end, the king agreed to this extreme measure. But the question remained - who would be the sacrifice? His ministers suggested that he could use one of his prisoners, someone who had committed a grave crime, for the sacrifice. And so, it was arranged. The kingdom waited with bated breath, unsure of what the future held.\n\nTwo months after the sacrifice, the kingdom was filled with joyous news - the young queen was pregnant. King Kasinhavairaman was over the moon with happiness. To celebrate this good news, he arranged a grand feast, the likes of which the kingdom had never seen before.\n\nAfter a long but anticipated wait of several months, the queen gave birth to a beautiful baby boy. The king, filled with joy and pride, named his son Rajavairaman. The birth of his son marked a new beginning for the king and his kingdom.\n\nOverwhelmed with the success of the sacrifice and the birth of his son, the king decided to build the temple in the jungle. He thought it would be fitting to inaugurate the temple with the same ritual that had brought him his much-desired heir - another human sacrifice. So, he chose another prisoner who had committed a grave crime to be the sacrifice.\n\nThe king's actions soon turned into a grim routine. It was as if he had become addicted to the ritual of human sacrifice. He made it a yearly ritual, every year on the same day, which some say was today. He would choose another victim to offer to the gods, hoping to secure their blessings and favor.\n\nAt first, he only sacrificed prisoners who had done terrible deeds, thinking they deserved their fate. But later, he changed his mind. He thought that the gods would be more pleased if he sacrificed someone pure and innocent, someone who had no fault or sin. And so he began to prey on his own people, the people who had once rejoiced with him and his young queen. Some say that it was the elder queen who put this wicked idea into the king's head, out of jealousy and spite for the young queen and her son.\n\nThe people lived in fear and dread, never knowing who would be the next sacrifice. The king became careless and cruel. He was a good king for most of the year, helping his people and ruling with justice. But on the day of the sacrifice, he turned into a monster, snatching away someone innocent from their loved ones.\n\nThe people, living in constant fear, finally decided to take a stand. The elder queen, who was already displeased with the king, conspired against him with the people. During the ceremony, the king would travel from his palace to the temple in the jungle, crossing a lake that was full but not too deep. The king, seated on his elephant, would simply walk across it.\n\nBefore the next ceremony, the people undertook a difficult task. They dug a hole under the lake bed and covered it up. It was a challenging task, but the desperate situation drove them to extreme measures. The elder queen lent her support to their cause with her resources. When the day of the ceremony arrived, the king set out on his journey as usual. But as he crossed the lake, he and his elephant fell into the trap. His soldiers tried to save him, but the king was trapped under his elephant and drowned.\n\nThe prince was still very young when the king died. The elder queen made sure he never ascended the throne. The kingdom slowly fell apart. Some parts were taken over by powerful people within the kingdom, while others were attacked and captured by other kingdoms. The once powerful kingdom was no more.\n\nAfter the king's death, the lake began to change. It used to be full of water all year round, but it started to dry up. Now, it only fills up when it rains. For the rest of the year, it stays dry. People believe this is due to the king's curse.\n\nEvery year on the anniversary of the king's death, a strange thing happens. The lake bed, especially the spot where the hole was dug, turns into quicksand. It's said that the king's ghost, along with his ministers and soldiers, still make their procession on this day. Some even say that the ghost of the king continues to make sacrifices. Because of these rumors, no one dares to go out on this day.\n\nMeanwhile, the Koligaru tribe, who were once part of the kingdom, now live in the jungle near the temple. They have their own way of remembering this day. They hold a festival to celebrate the king's death and to protect themselves from his ghost.\n\n\n\nA hasty ending!\n\n\n#adventure #mystery #kingdom #supernatural #culture #history #sacrifice","f":"i","l":["hor","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/detour-4-end-elders-exchanged-glance-before-answering-closed-cs8q9h","p":"cs746u","n":"cs95u5"}