{"d":"2024-02-13T18:30:18Z","t":"It's not love\n\nMy 'wife' Tanisha and I are not really married. We only act like a couple when we have to, for the sake of appearances. But behind closed doors, we are nothing more than strangers who just share an apartment. \n\n                                                              cont...","c":"My 'wife' Tanisha and I are not really married. We only act like a couple when we have to, for the sake of appearances. But behind closed doors, we are nothing more than strangers who just share an apartment. We have separate bedrooms, separate schedules, separate lives. We hardly ever communicate, let alone spend quality time together. We don't share any hobbies, passions, or dreams. We are as different as night and day. We are not lovers, friends, not even enemies. We are just flatmates.\n\n\nThe first time I saw Tanisha was in Bangalore, right after the lockdown was lifted. I had just arrived in the city to join my new office, and I was feeling anxious and nervous. I checked into the hotel that was booked for me and headed straight for the elevator. I wanted to get to my room as soon as possible and relax. I didn't pay attention to the people around me, and I didn't notice the girl who was stepping out of the lift as I rushed in. My trolley bumped into her leg and she let out a small cry of pain. I turned around and saw her clutching her leg and glaring at me.\n\n“I'm so sorry, I didn't see you there,” I said, feeling embarrassed and guilty.\n\n“Watch where you're going, you idiot!” she snapped, her voice muffled by the blue mask she was wearing. She had short hair and round glasses, and she looked angry and annoyed.\n\n“I'm really sorry, are you okay?” I asked, hoping to calm her down.\n\n“Just leave me alone,” she said, and limped away to the sofa in the lobby. I quickly got into the elevator and pressed the button for my floor. I felt my ears burning with embarrassement. As the lift doors closed, I caught a glimpse of her sitting on the sofa, rubbing her leg. I didn't think much of her then, or that I would ever see her again.\n\nAfter the incident, I decided to take it easy and rest for the day. The next morning, I went down to the hotel's dining area for breakfast. I was sitting alone, when I heard a voice asking, “May I join you?” I looked up and was surprised to see the girl from the elevator. I felt a wave of embarrassment wash over me, but I managed to nod and gesture to the empty seat across from me.\n\nShe sat down and immediately began to apologize for her behavior the previous day. “I'm sorry for being so rude yesterday,” she said, extending her hand towards me. “I'm Tanisha.”\n\nI shook her hand, introducing myself in return. “No problem. I'm sorry too. I should have been more careful.”\n\nWe chatted a bit more, exchanging pleasantries and small talk. After breakfast, I went to my new office to meet my colleagues and get a feel for the place. Once I was done with that, I started my search for a place to live. I wanted something close to my office, so I wouldn't have to commute too much. I wasn't keen on dealing with brokers and their exorbitant fees, so I decided to look for places on my own. I spent hours walking around the neighborhood, looking for 'To Let' signs. I visited a few places, but none of them felt right. They were either too small, too old, or just not what I was looking for.\n\nThe next few days were more of the same - work in the morning, house hunting in the afternoon. In between, I would run into Tanisha at the hotel. We started to get to know each other better. She had arrived in the city two weeks before me and was also looking for a place to rent.\n\nHowever, finding a suitable place was proving to be a challenge. No matter where I looked, I kept running into the same problems. The places that were within my budget were not to the landlords' liking because they didn't want to rent to bachelors. The ones that were available were in such poor condition that I couldn't imagine living there. There was even one place on the seventh floor of a building with no elevator!\n\n\nSaturday rolled around, a day off from work, and I decided to spend it looking for a place to live. As I was leaving the hotel, I bumped into Tanisha in the lobby.\n\n“Are you going house hunting?” she asked.\n\nI nodded, “Yes, I am. It's been quite a task finding a suitable place.”\n\nShe gave a small laugh, “Tell me about it. Do you mind if I join you? Maybe we can help each other out.”\n\nI agreed, thinking that having company might make the daunting task a bit more bearable. So, we set off together, visiting a couple of places in the vicinity of our hotel. However, none of them were to our liking.\n\nWe didn't have to walk far before we came across a two-storey house with a gatekeeper at the entrance. We approached him and inquired about any available spaces for rent. He informed us that the entire first floor, a 2BHK, was vacant. Intrigued, we decided to take a look.\n\nAs we toured the place, the gatekeeper shared that the owner used to live on the ground floor. However, during the lockdown, the previous tenant had moved out, and the owner's son, who lived elsewhere in the city, had taken his parents with him. The gatekeeper was now the caretaker of the property.\n\nThe house was spacious, with both bedrooms having attached bathrooms and balconies. There was a kitchen, a large drawing room and even a small spare room. It could easily have been a 3BHK. We asked about the rent, and to my surprise, it was well within my budget when divided by two. It felt like a lucky find.\n\nWe took the owner's contact number from the gatekeeper and told him we would consider. As we were leaving, the gatekeeper mused aloud, “The owner prefers renting to couples. I hope you two will take this place. You seem like a nice couple.” We didn't correct his assumption, just exchanged a glance and left.\n\nAs we continued our search, I couldn't help but comment, “That was a nice place, wasn't it?”\n\nTanisha nodded and said, “Yeah, it was. And it fit my budget too. I've been looking for a place for so long.”\n\nI sighed, “Too bad they want couples. I guess it's not for me.”\n\nShe looked at me with a mischievous smile and said, “What if we become a couple?”\n\nI looked at her, taken aback. She quickly clarified, “I mean, we can pretend to be a couple. The gatekeeper already thinks we are. And no one else has to know. It's not like we have to do anything.”\n\nI was still doubtful. “But won't it be weird to live with a stranger? I mean, we barely know each other.”\n\nShe shrugged and said, “I don't really know anyone in this city. Do you? It's not like we have any friends or family here. And we can have our own rooms and privacy. It's just a matter of convenience.”\n\nI still felt uneasy about the whole idea. “I don't know. It sounds strange. Let's look at some more places.” We did, but none of them matched the first one. I started to wonder if Tanisha's suggestion wasn't so crazy after all.\n\nThe next day I met Tanisha. I approached her and confessed that I had reconsidered her proposal. She seemed excited. She smiled and said, “Really? That's great! I'm so glad you changed your mind.”\n\nI still had some reservations and asked, “But what if they ask for proof that we're a couple? Like a marriage certificate or something?”\n\n“We'll cross that bridge when we come to it,” she assured me. So, we called the owner, completed all the formalities, and just like that, the house was ours. We didn't need to show any proof.\n\nOnce we had the house, the first thing we did was establish some ground rules. We sat down and came up with a verbal agreement:\n\n1. We will only act like a couple in front of the gatekeeper or anyone else who might ask. In reality, we would live our own separate lives.\n2. We would respect each other's personal space and privacy.\n3. We would handle our own expenses. Any shared costs would be split equally.\n4. Any new decisions or changes would be discussed and agreed upon by both of us.\n\nWith these rules in place, we became 'married' flatmates. We each had our own set of keys to the main door and our individual rooms, which we kept locked when we went out. We didn't keep tabs on each other's comings and goings. At home, we mostly stayed in our own rooms, leading our separate lives. We cooked our own meals at our own convenience. It was an unusual arrangement, but it worked for us. We had our independence and a comfortable place to live, and that's all that mattered.\n\n\nOn the weekends, a maid comes to clean the house and do the laundry. Those are the days when we have to put on our best act. We sit together, watch TV, cook, and eat together. We compliment each other's culinary skills, making small talk. To an outsider, it might seem like we are growing closer, but that isn't the case. Tanisha lives her life, and I live mine. It is far from love.\n\n\nWhen the lockdown restrictions eased, the owners of the house decided to return and live on the ground floor for a week or two every month. They were an elderly couple, kind and friendly. When they were around, the owner's wife would sometimes come up to chat with us in the evening. She would often send up some dish she had cooked. This added a new layer to our pretense. We have to act even more like a couple in front of her. We use only one of the bedrooms and keep the other one locked. We are just playing our parts, nothing more. There's nothing romantic about it.\n\n\nOne weekend, as we were having lunch together, Tanisha turned to me and asked, “Do you have a girlfriend?” I looked at her and replied, “I used to, but she broke up after I moved to Bangalore. I've been single since then.” Tanisha gave a small smile, but I could feel a pang of sadness and disappointment. After finishing my meal, I retreated to my room.\n\nLater that evening, there was a knock on my door. It was Tanisha, holding a bowl of pasta. “I noticed you seemed a bit down,” she said. “I made some pasta and thought it might cheer you up.” I smiled, took the bowl from her, and thanked her. The pasta was delicious, and when I complimented her cooking, she blushed, her cheeks turning a dark shade of red. It was a simple exchange, a moment of appreciation, nothing more. There was no romantic undertone to it. From the next day, we resumed our usual routine, living our separate lives under the same roof.\n\n\nOne weekday, while I was working from home, I noticed that Tanisha hadn't prepared any food for herself. I assumed she must have been in a rush and didn't have time to cook. Since I was making fried rice for myself, I decided to make a little extra and left it in the fridge in her designated spot. After all, she was my flatmate.\n\nThe next day, Tanisha approached me and said, “I noticed you made some fried rice yesterday. That was really sweet of you.” I could feel my cheeks turning red as I replied, “Oh, I just thought you would be hungry.” She smiled and said, “I actually had a party to attend and ate there. But I did taste your fried rice, and it was delicious.” I felt a bit embarrassed but also pleased that she liked my cooking.\n\nA few days later, Tanisha returned the favor. She cooked a meal and shared some with me. From then on, we often cook for each other. It became a part of our routine, a small act of kindness that we extended towards each other. But it's nothing more than that. We are just two people, sharing a living space, each leading our own life. It's not love.\n\n\nOne day, the owner invited us to his daughter Neha's wedding, which was to be held at their other house in the city. We had to act as husband and wife. Tanisha wore a green dress - green was her favorite color. I wore a dark blue suit. As we were getting ready, I couldn't help but notice how beautiful Tanisha looked in her dress. “You look beautiful,” I told her. She smiled shyly and returned the compliment, “You look quite handsome too.” Of course, she could say that - it's perfectly fine to compliment someone on their appearance.\n\nWe attended the wedding and acted our parts convincingly. Everyone commented on how perfect we seemed together. On our way back from the venue, we couldn't help but laugh about the whole incident.\n\n\nThese days, we find ourselves conversing a bit more. It was bound to happen, after all, we've been living under the same roof for quite some time now. But it's nothing more than friendly banter between two flatmates. There's no love involved, just mutual respect and understanding.\n\n\nNowadays, we often find ourselves going out during the weekends. It's just two flatmates, spending quality time together, maintaining our act as a couple. We visit different places, watch movies, dine out at restaurants. Sometimes, we even meet each other's new friends. When the owners are home, we make sure to act perfectly like a couple. There's no room for doubt there.\n\nOur TV watching habits have also changed a bit. Tanisha used to watch romantic shows during the evening, while I used to watch late-night horror shows. But now, I often join her for the romantic shows, and she stays up with me for the horror movies. It's not abnormal, after all, routines can change. You can't just follow the same routine always, sometimes you have to mix it up a bit. It's just another part of our pretend married life, nothing more.\n\n\nIt's hard to believe, but it's been almost two years since we started living together. Time seems to have flown by. Last week, while I was returning from the office, I happened to pass by a flower shop. On a whim, I decided to buy a bunch of roses for Tanisha. After all, she's my flatmate, and there's nothing wrong with giving small gifts to brighten up someone's day. It was purely coincidental that it was the 7th of February.\n\nWhen I handed Tanisha the roses, her face lit up with happiness. She took a moment to smell the fresh blooms, her eyes closing as she took in the sweet fragrance. She then carefully arranged them in a vase, placing it on the dining table where we could both enjoy their beauty. It was the normal thing to do - the flowers were beautiful, after all.\n\n\nI'm sitting in the drawing room, engrossed in the TV. Tanisha is here too, just like every other day. But today, she looks different. She's dressed in her favorite green saree and looks more beautiful than ever. It's completely normal for her to dress up, it's her life after all. And just like her, I've worn my favorite shirt too. We can do such things, it's not like we are interfering with each other's lives.\n\nToday, I felt like watching a romantic movie. So, we both sit together, engrossed in the movie. Tanisha rests her head on my shoulder. She must have had a hectic day today, she was tired. To make her comfortable, I come closer too, resting my head on hers. Tanisha holds my hand, and I hold hers too.\n\nBut this much is normal, right? Let's be clear, nothing's happening. I'm pretty sure it's not love.\n\n\n\n#love? #pretend #cohabitation #convenience #stranger #ambiguous #blurredlines #flatmates","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/it-s-not-love-my-wife-tanisha-i-not-really-married-only-act-cs95u5","p":"cs8q9h","n":"cta5ia"}