{"d":"2023-10-11T07:32:42Z","t":"Alex was a struggling comedian who lived in a dingy apartment in the outskirts of the city. He had always dreamed of making people laugh, but his jokes never seemed to land. He had tried everything: stand-up, improv, sketch, podcasts, YouTube videos, but nothing worked. He was always met with silence, groans, or boos from the audience. He had no fans, no friends, no family, no money, and no hope.\n\n                                                                 cont...","c":"One day, he received an eviction notice from his landlord. He had not paid his rent for three months, and he had to move out by the end of the week. He felt like giving up, and he decided to pack his belongings and look for a cheaper place to stay. As he was stuffing his clothes into a suitcase, he noticed an old notebook under his bed. He picked it up and opened it. It was filled with handwritten jokes that made him laugh out loud. They were witty, clever, original, and hilarious. He wondered who had written them and how they had ended up in his apartment. He assumed that they belonged to the previous tenant, who must have forgotten them when he moved out.\n\nAlex felt a surge of excitement and curiosity. He decided to try some of the jokes at his next gig, which was at a small bar downtown. He hoped that they would work better than his own material. He took the notebook with him and headed to the venue.\n\nThat night, Alex performed the best set of his life. The crowd loved him. They laughed at every joke, clapped at every punchline, and cheered at every callback. Alex felt a rush of adrenaline and joy. He had finally found his voice as a comedian. He thanked the audience and left the stage to a standing ovation.\n\nAlex was ecstatic. He couldn't believe what had just happened. He decided to use more jokes from the notebook at his future gigs. He started getting more bookings, more fans, more followers, more money, and more fame. He moved out of his old apartment and into a better one. He bought new clothes, new gadgets, new furniture, and new friends. He was living the dream.\n\nBut he also felt guilty. He knew that he was plagiarizing someone else's work. He knew that he was not being honest with himself or his audience. He knew that he was not a real comedian. But he couldn't stop. He was addicted to the applause, the praise, the attention, and the success. He rationalized that he was doing no harm, that he was making people happy, that he was honoring the unknown writer's talent.\n\nOne day, while cleaning his new apartment, Alex stumbled upon his childhood diary that he had packed with his other belongings. He decided to read it, hoping to find some inspiration for his comedy. He opened the diary and scanned the pages. He found something odd about the handwriting. It looked familiar, but he couldn't place it. He took out the notebook and compared it with the diary. He was stunned to see that they matched perfectly.\n\nHe remembered his childhood. He had always loved comedy. He used to watch his favorite comedians on TV, read funny books and magazines, and write his own jokes in his notebook. He wanted to make people laugh and be happy. But as he grew up, he faced the difficulties of life: poverty, loneliness, rejection, failure. He forgot about his jokes and his comedy. He lost his sense of humor and his identity.\n\nHe realized that he had been stealing from himself.\nHe realized that the notebook was his own.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 2 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#struggle #success #guilt\nToday, write a #shortstory titled #thenotebook. Language no bar. Feel free to extend the story in the caption of your posts. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[3254,3268]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/alex-struggling-comedian-who-lived-dingy-apartment-outskirts-csc29b","p":"cscwsx","n":"csdc70"}