{"d":"2023-10-15T07:39:09Z","t":"\n\n\n\n\nDhruv was a poor but honest boy. He lived with his parents in a small apartment in the city. His father worked as a clerk in a bank, and his mother was a seamstress. They barely made enough money to pay the rent and buy food.\n\nOne day, as Dhruv was walking home from school, he saw something shiny on the sidewalk. He bent down and picked it up. It was a leather wallet, stuffed with bills. Dhruv opened it and counted the money. There was ₹4000 in it, more than he had ever seen in his life.","c":"Dhruv felt a surge of excitement and temptation. He thought of all the things he could buy with the money: new clothes, books, toys, candy. He thought of how happy his mother would be if he gave her some of the money. She could buy some fabric and make herself a nice dress. He thought of how proud his father would be if he paid some of the bills. He could help them get out of debt and live a better life.\n\nBut then he remembered that the wallet was not his. It belonged to someone else, someone who might need it more than him. He felt a pang of guilt and fear. Dhruv wondered what would happen if he kept the money. Would anyone notice? Would they report it to the police? Would they find Dhruv and punish him?\n\nHe decided that he should return the wallet to its rightful owner. He looked around and saw a police officer standing on the corner, directing traffic. He thought of giving the wallet to him, hoping that he would deliver it to it's owner. He walked towards the officer, clutching the wallet in his hand.\n\nBut as he got closer, he hesitated. He thought of his family, who were struggling to make ends meet. They barely had enough money for food and rent, let alone anything else. He looked at the officer again and saw that he was busy with his job. He didn't seem to notice Dhruv or his wallet. Dhruv felt a surge of temptation and greed. He decided to keep the money for himself and his family. He felt guilty for stealing someone else's wallet, but he convinced himself that it was a stroke of luck, a gift from heaven.\n\nHe reached his apartment and opened the door. He saw his mother sitting on the couch, knitting a sweater for him. She looked tired and pale, but she smiled when she saw him.\n\n“Hello, Dhruv,” she said. “How was school today?”\n\n“Fine, Mom,” Dhruv said.\n\nHe took out the money from the wallet and handed it to her. “Here, Mom,” he said. “This is for you.”\n\nHis mother looked at him with surprise and confusion. “Where did you get this, Dhruv?” she asked.\n\nDhruv lied for the first time in his life. “I got it as a prize in school,” he said. “I won an essay contest.”\n\nHis mother looked at him with disbelief and joy. “Really?” she said. “Oh, Dhruv, that's wonderful! You're such a smart boy! I'm so proud of you!”\n\nShe hugged him again and kissed him on the cheek. “Thank you, Dhruv,” she said. “This is very generous of you.” She took the money and put it in her purse.\n\n“What are you going to do with it?” Dhruv asked.\n\n“I'm going to buy some groceries,” she said. “And maybe some new clothes for you and me.” She smiled at him.\n\n“And maybe we can go out for dinner tonight,” she said. “To celebrate your achievement.”\n\nDhruv smiled back at her. “That sounds great, Mom,” he said.\n\nHe felt happy for making his mother happy, but he also felt guilty for lying to her. He went to his room and threw the wallet under his bed. He tried to forget about it and focus on his homework.\n\nThat night, his father came home late from work. He looked tired and sad.\n\n“Hello, Dad,” Dhruv said.\n\n“Hello, Dhruv,” his father said.\n\n“How are you?” Dhruv asked.\n\n“Not so good,” his father said. He sat down on the couch and sighed.\n\n“What's wrong?” Dhruv asked.\n\nHis father shook his head. “I lost my wallet today,” he said.\n\nDhruv felt a shock of horror and disbelief. “Your wallet?” he repeated. He felt a surge of guilt and regret. He thought that since he had taken someone else's wallet, his father's wallet had been taken away from him. He felt like crying.\n\n“Yes,” his father said. “I don't know how or where I lost it, but I can't find it anywhere.” He looked at Dhruv with despair. “It had ₹4000 in it,” he said. “All my savings for this month.”\n\n₹4000? His father's savings? The same amount that was in the wallet he had found? Dhruv ran to his room and grabbed the wallet from under his bed. He came back to the living room and put it on the table.\n\n“Here, Dad,” he said. “Here's your wallet.”\n\nHis father looked at him with astonishment and relief. “My wallet?” he said. “Where did you find it?”\n\nDhruv told him the truth. He confessed everything to his father. He told him how he had found the wallet, how he had decided to keep the money, how he had lied to his mother. He begged for forgiveness.\n\nHis father listened quietly, his face impassive. As Dhruv finished his confession, there was a long silence. Then, his father sighed deeply, his eyes filled with a mix of disappointment and relief. “Dhruv,” he said in a soft voice, “I'm disappointed that you lied. But I'm relieved that you had the courage to confess. It takes a lot of bravery to admit your mistakes. Let's take this as a lesson learned.” He hugged Dhruv, assuring him that everyone makes mistakes and what's important is to acknowledge them and make amends.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 4 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#wallet #honesty #amend\nToday, write a #shortstory titled #thefirstlie. Language no bar. Feel free to extend the story in the caption of your posts. #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[5053,5067]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/dhruv-poor-honest-boy-lived-his-parents-small-apartment-city-csd5a2","p":"csdwky","n":"cseftc"}