{"d":"2023-10-25T08:28:28Z","t":"Mohan was hungry. His mother worked as a maid in a nearby apartment complex, and his father was a rickshaw driver. They barely made enough to pay the rent for their tiny room in the slum. Mohan had to walk to school every day, carrying his old backpack and his metal lunch box. His lunch box usually contained some rice and dal, or sometimes just a roti and some pickle. He hated it.","c":"Neha was bored. She always was. Her parents were software engineers who worked for a multinational company. They lived in a luxurious flat in the same apartment complex where Mohan's mother worked. Neha had everything she wanted: a big room, a laptop, a smartphone, a bicycle, and many toys. But she didn't have anyone to play with. Her parents were always busy, and her schoolmates were snobbish and mean. She hated it.\n\nNeha and Mohan were in the same class, but they lived in different worlds. They went to different schools. Neha studied in a prestigious private school that had air-conditioned classrooms, smart boards, and well-qualified teachers. Mohan studied in a government school that had dilapidated buildings, broken furniture, and overcrowded classes.\n\nEvery day after school, Neha and Mohan would go to the same park to eat their lunch. The park was a green oasis in the middle of the concrete jungle, with trees, flowers, and a fountain. It was a place where they could escape from their problems and find some peace and quiet.\n\nNeha always sat on a bench near the fountain, while Mohan sat anywhere he liked: on the grass, a rock, or a swing. Neha always had a fancy plastic lunch box with cartoon characters, that contained store-bought food like sandwiches, burgers, pizzas, cakes, or chocolates. In contrast, Mohan had a simple, dented lunch box.\n\nNeha envied Mohan for his homemade food. She knew that his mother cooked it with love and care, while her maid just bought whatever was available in the market. Mohan, on the other hand, envied Neha for her fancy food. He thought that her food was delicious and expensive, while his own was bland and cheap. He wished he could taste some of the foods he saw on TV or in magazines.\n\nThey would look at each other curiously, then shyly, then nervously. They didn't know what to say or do. They felt an invisible barrier between them, one created by their different worlds.\n\nOne day, Mohan mustered enough courage to ask Neha for a piece of her food. He approached her timidly and said, \"Hi, I'm Mohan. Can I have some of your food? It looks so good.\"\n\nNeha looked at him with surprise and curiosity. She had never spoken to him before, but she had noticed him many times. He was thin and dark-skinned, with ragged clothes and messy hair. He looked hungry and sad. She smiled back at him and said, \"Hi, I'm Neha. Of course, you can have some of my lunch. Here, take this sandwich.\"\n\nMohan took the sandwich gratefully and took a bite. He felt a burst of flavors in his mouth: cheese, tomato, lettuce, and mayonnaise. He had never tasted anything like it before and didn't even know the name of what he was eating. He smiled and said, \"Thank you. This is very good.\"\n\nNeha watched him eat with interest and amusement. She wondered what he thought of her food. She decided to ask him for some of his food too. She said, \"Can I have some of your food? It smells so nice.\"\n\nMohan looked at her with astonishment and hesitation. He didn't think she would like his food. He thought it was too simple and plain for her. He said, \"Are you sure? It's just roti and pickle.\"\n\nNeha nodded eagerly and said, \"Yes, I'm sure. I love roti and pickle. My grandmother used to make them for me when I was little. She passed away last year.\"\n\nMohan felt sorry for her and said, \"I'm sorry to hear that. My grandmother lives with us. She helps my mother with the cooking.\"\n\nNeha smiled sadly and said, \"You're lucky to have your grandmother with you. She must love you a lot.\"\n\nMohan smiled back and said, \"She does. And so does my mother. And my father.\"\n\nNeha felt a pang of envy and said, \"You're lucky to have your parents too. They must care for you a lot.\"\n\nMohan nodded and said, \"They do. But they work very hard to make ends meet. They don't have much time for me.\"\n\nNeha felt a surge of sympathy and said, \"I know how that feels. My parents work very hard too. They earn a lot of money, but they don't have much time for me either.\"\n\nThey looked at each other with understanding and compassion. They realized that they had more in common than they thought. They exchanged their lunch boxes and tasted each other's food. They started talking about their lives and their hobbies. They found that they could relate to each other's feelings and experiences. They became friends.\n\nFrom that day on, they would always meet for lunch in the park and share their food. They would sit anywhere they liked: on the grass, on a rock, or on a swing. They didn't care about the invisible barrier between them anymore.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 10 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#friendship #diversity #empathy\nCollab and write a #shortstory titled The Lunch Box. Language no bar. Feel free to extend the story in the caption of your posts. #thelunchboxstory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[4886,4900]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/mohan-hungry-his-mother-worked-maid-nearby-apartment-complex-csglqs","p":"csgc8i","n":"csgu7w"}