{"d":"2023-11-14T13:09:05Z","t":"I never thought I would regret making a deal with the devil. After all, he had given me what I wanted most: a child. My wife and I had tried everything to conceive, but nothing worked. We prayed, we begged, we visited countless doctors and specialists. Nothing. We were desperate and hopeless.\n\n                                                          cont...","c":"That's when he came to me. He offered me a bargain: he would grant me a child, but in exchange, he would take my first born daughter. He wanted her not just as a possession, but as his bride. I hesitated, but he assured me that it was a fair deal. He said he only wanted a daughter, not a son. He said he would leave me alone if I had a boy. He said he would not interfere with my life or my family. He said he would come back only when the time was right.\n\nI agreed. I signed the contract with my blood. I felt a surge of pain and then relief. He smiled and vanished.\n\nA few weeks later, my wife told me the news. She was pregnant. We were overjoyed. We celebrated and thanked God for this miracle, which in hindsight, was probably hypocritical. We didn't tell anyone about the devil. We hoped he would forget about us.\n\nNine months later, our son was born. He was handsome and healthy. We named him Ivan. We loved him more than anything. We felt blessed and lucky. We had tricked the devil, we thought. We decided to not have any more children. No children - no chance of a daughter to give away to the devil.\n\nWe raised Ivan with care and affection. He was a smart and happy child. He excelled in school and sports. He had many friends and hobbies. He was our pride and joy. We never noticed anything unusual about him. We never doubted his happiness.\n\nTwenty years passed. The devil never returned. Frankly, I had forgotten about him. I thought he had given up on us. I thought he had moved on to other victims. I thought we were safe.\n\nI was wrong.\n\nToday, Ivan came home for his college holidays. He looked different. He had grown his hair long and curled it. He wore a floral dress and heels. He had a piercing on his ear and a necklace on his neck. He looked confident and beautiful.\n\nWe hugged him and welcomed him. We asked him about his studies and his friends. We told him how much we missed him and how proud we were of him.\n\nBut something was bothering him. He seemed nervous and restless. He kept fidgeting and avoiding eye contact. He had something to tell us, something important.\n\nWe sat down for dinner. He took a deep breath and spoke.\n\n“Mom, Dad, I have something to tell you. I've spent a lot of time thinking about this, and I've realized that I identify as a girl. I'm transgender. I've been seeing a therapist and taking hormones for a few months now. I'm planning to have surgery soon. I hope you understand and support me. I'm still your child. I'm still Ivan. But I'm also Irene. This is who I am. This is who I've always been.\"\n\nHe looked at us with hope and fear. He waited for our reaction.\n\nI was stunned. I couldn't believe what I had heard. I couldn't accept what he had said. He was my son, not my daughter. He was Ivan, not Irene. He was a boy, not a girl. He was wrong. He was confused. He was sick.\n\nI felt a surge of anger and denial. I wanted to yell at him and shake him. I wanted to tell him to stop this nonsense and be normal. I wanted to tell him to forget this idea and be happy. I wanted to tell him that I loved him, but only as a boy.\n\nBut before I could say anything, I felt a cold hand on my shoulder. I turned around and saw him. He was smiling. He had not aged a day. He looked the same as he did twenty years ago.\n\nHe was the devil. He had come back for his bride.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 23 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#devil #transgender #consequences\nCollab and write a #shortstory titled The Bad Listener. Language no bar. Feel free to extend the story in the caption of your posts. #badlistenerstory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[3651,3665]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-never-thought-i-would-regret-making-deal-devil-after-all-i-cslonl","p":"cslfly","n":"cslv40"}