{"d":"2023-11-23T15:19:01Z","t":"Xavier had a troubled past. He had lost everything he cared about and wanted to start a new life. He moved to a cabin in the woods, hoping to find some peace and solace. He lived in a protected area of the forest, which gave him an advantage. He also found a way to make money by selling rare and endangered plants from the forest on the black market. He had no scruples or remorse about his actions. He only cared about himself.","c":"Every morning, he would explore the forest and look for exotic ferns and orchids. He had some contacts online who would pay him a lot of money for his illegal products. He had a small greenhouse in his cabin where he would keep and pack his plants. He would then send them to his customers using a fake name and address. He thought he was smart and untouchable. He thought he had found a way to escape his problems.\n\nOne morning, he discovered a secret clearing that he had never seen before. It was full of amazing plants and mushrooms. He felt like he had found a gold mine. He started collecting them eagerly, filling his backpack with his valuable loot. He didn't pay attention to the weird symbols on some of the plants, or the faint glow that came from them. He didn't listen to the whispers that sounded in his ears.\n\n“Please don't take us,” a gentle voice said.\n\n“Who's there?” Xavier asked, looking around anxiously. He saw no one. Was he hallucinating? Xavier thought. Maybe it was because of the mushrooms he had picked.\n\n“There will be bad consequences,” another voice warned. The voices seemed to be coming from the trees around him.\n\nXavier felt a surge of fear. He dropped his collection and started running towards his cabin. He hoped to find safety and comfort in his home, but the forest seemed to be against him. The further he ran, the louder the trees talked, but suddenly it stopped. He heard a deafening silence that made him shiver. He wondered if he had escaped the wrath of the forest, or if it was waiting for him to make a mistake.\n\nXavier reached his cabin and locked the door behind him. He plopped down on a wooden chair and tried to calm himself. He felt his heart pounding in his chest, his breath ragged. He looked around his cabin, hoping to find some comfort in his familiar surroundings. He saw his greenhouse, his plants, his laptop. He tried to convince himself that everything was normal, that nothing had changed. Xavier didn't realize when he fell asleep, nor could he make sense of the time when he woke up. He had no idea how long he had been sitting on the chair, or what had happened to him while he was asleep.\n\nHe woke up in his cabin, feeling a strange sensation in his body. He tried to move, but couldn't. He looked down and saw that his body had fused with the wooden chair he was sitting on. His hands had turned into branches, his feet into roots. He felt his mouth filling with leaves, his eyes with seeds.\n\nHe felt a tear roll down his cheek, but it quickly dried up. He felt no pain, no emotion, no thought. He felt nothing at all.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 27 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#horror #transformation #revenge\nCollab and write a #shortstory titled The Talking Tree. Language no bar. Feel free to extend the story in the caption of your posts. #talkingtreestory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2920,2934]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/xavier-had-troubled-past-had-lost-everything-cared-about-new-csnu93","p":"csmtns","n":"csokiq"}