{"d":"2023-11-26T12:48:13Z","t":"The neon sign flickered as Zarif stumbled into the jewelry shop, the scent of alcohol preceding him. Lily, a tired-looking woman with an apron still tied around her waist, shot him a disapproving look as she continued tidying up the display cases. The shop was about to close, and the last thing she wanted was to deal with a drunk customer.\n\n                                                          cont...","c":"“What do you want?” Lily asked, her tone sharp. “We're closing.”\n\nZarif, swaying slightly on his feet, mumbled something about wanting to see earrings. Lily sighed, irritation evident in her eyes. “Come back tomorrow when you're sober,” she retorted.\n\n“But I've got money!” Zarif slurred, slamming a wad of notes onto the counter. “Show me the best earrings you've got.”\n\nLily raised an eyebrow, unimpressed. “Money doesn't change the fact that you're drunk and disruptive. Leave.”\n\nZarif, surprisingly calm and collected despite his inebriated state, pleaded, “It's important. I'm buying it for my girlfriend. She loves earrings. She always wanted me to buy her earrings.”\n\nLily felt a pang of pity for him. She wondered how lucky his girlfriend was and how much he loved her that he was buying such expensive gifts for her. She softened slightly. “Fine, but make it quick.”\n\nZarif nodded gratefully and said, “Just choose the best one. Pretend it's for you. Pick what you like the most, and pack it for me.”\n\nLily hesitated for a moment but then started showcasing a few options. “Here, take a look. Choose.”\n\nZarif, seemingly indifferent, said, “You choose. You are a woman. You know what women like. Pretend it's a gift for you.”\n\nLily smiled and picked a pair of earrings that caught her eye. They were beautiful and elegant. They had a round diamond in the center and smaller diamonds around it. They sparkled in the light.\n\n“These are the ones I like the most. They are very classy and suit any occasion. They cost 50,000. Is that okay with you?” She asked.\n\nZarif nodded and pointed at the bundle of notes on the counter. “That should be enough,” he said.\n\nLily packed the earrings in a small box and handed it to him. She also gave him a receipt and thanked him for his purchase. “Thank you, sir. I hope your girlfriend likes the earrings. Have a good night.”\n\nZarif woke up with a headache the next day. He was lying on his bed in his apartment. He looked around and saw the earrings he had bought. He slowly remembered the events of last night and got worried. Had he misbehaved with the saleswoman? Had he paid enough for the earrings? Had he done something stupid?\n\nHe had bought the earrings for his girlfriend, Neha. She used to ask for similar gifts. She loved jewelry. She loved him. Or so he thought.\n\nZarif was a writer with a few best-sellers. He was famous and successful, but he was not rich. He had a modest income and a simple lifestyle. He couldn't afford to buy expensive gifts for his girlfriend. He used to promise her that he would buy her everything she wanted when he became rich.\n\nBut today, things were different. Zarif had money now. He had enough money to buy the most expensive earrings in the shop. He had enough money to fulfill his promise to Neha. But Neha was not there to receive them.\n\nYesterday morning, he had received the wedding card. It was embossed with golden letters that read, “Neha weds Dhruv”. He had held the card in his hands, feeling as if the ground had been pulled from under his feet. He had read the words over and over again. He had wished it was his name on the card instead of Dhruv's. He had wished it was him Neha was marrying.\n\nHe had never drank in his life. But he drank that day. He drank a lot. He drank until he forgot everything. He drank until he felt nothing.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 28 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#betrayal #jewellery #promise\nCollab and write a #shortstory titled The Wedding Card. Language no bar. Feel free to extend the story in the caption of your posts. #weddingcardstory #YourQuoteAndMine\nCollaborating with YourQuote Baba ","f":"i","m":[[3663,3677]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/neon-sign-flickered-zarif-stumbled-into-jewelry-shop-scent-csokiq","p":"csnu93","n":"cso150"}