{"d":"2023-12-23T19:26:03Z","t":"The Art of Deception 2\n\nAs the evening sun began to set, Mahaira could feel her heart pounding in her chest. It was time for Arjun to return from his office. She had to get out before he returned. The thought of facing him, of seeing the confusion and hurt in his eyes, was too much for her to bear. She didn't have the heart to tell Arjun to his face. She couldn't bear to shatter the polite facade they had maintained for a year.\n                                                          ...","c":"#the_art_of_deception\n\nAs the evening sun began to set, Mahaira could feel her heart pounding in her chest. It was time for Arjun to return from his office. She had to get out before he returned. The thought of facing him, of seeing the confusion and hurt in his eyes, was too much for her to bear. She didn't have the heart to tell Arjun to his face. She couldn't bear to shatter the polite facade they had maintained for a year.\n\nEshan had told her that the train wasn't until later that night. This gave her some time, but not much. She had to act quickly, yet carefully. Her mother-in-law was sleeping and wouldn't wake up until dinner. This was her chance.\n\nWith trembling hands, Mahaira quickly wrote a short note letting Arjun know that she was leaving. She placed the note on the bed, a silent goodbye to the man she had shared a home with. She then moved to the mirror, her reflection staring back at her. She fixed her hair, trying to calm her racing heart. She looked at herself, at the woman she had become over the past year.\n\nHer eyes then fell on the framed picture of her and Arjun on the wall. It was a picture from their wedding day, both of them smiling at the camera. She looked at it one last time, a pang of guilt washing over her. But she knew she had to do this, for herself, for Eshan. With a heavy heart, she quietly made her way out of the room.\n\nMahaira stepped out of the house, her heart pounding in her chest. She looked around, the familiar surroundings now seeming alien to her. Arjun's house was just a bit out of the center of the city, but it was right near a main road and there was a bus station nearby. Office goers were returning after their long day at work, their faces tired but relieved. She wondered if Arjun would be among them soon, returning home to find her gone. She had to get out before he returned.\n\nA bus, which would be going towards the railway station, pulled up at the bus stop. It was packed with passengers, their faces weary from a long day at work. A few got down, their places immediately taken by those waiting to get on. Mahaira hesitated, her eyes scanning the crowded bus. She didn't want to board the crowded bus. But she knew she had no choice. It was office closing time and she knew she would probably not get anything empty. This was her only chance.\n\nWith a deep breath, Mahaira stepped onto the bus, clutching her small suitcase tightly. She tried to find something to hold onto as the bus lurched forward, the sudden movement almost throwing her off balance. The central railway station was quite a distance from Arjun's house, and given the time of day, the traffic was heavy.\n\nThe bus moved at a slow pace, stopping frequently either to let passengers on and off or to wait for the traffic to clear. Each stop seemed to stretch on forever, the minutes ticking by slowly as she watched the city pass by through the window. It would take more than an hour to get to the station at this rate. But she wasn't worried. She would still have a couple more hours left.\n\nFinally, after what seemed like an eternity, the bus reached the railway station bus stop. Mahaira got down, her legs shaky from the long journey. She made her way to the station, her small suitcase trailing behind her. She found a bench outside the station and sat down, her heart still pounding in her chest.\n\nShe watched as office returners hurried past her, their faces a blur as they rushed to catch their local trains. She wondered if any of them noticed her, a lone woman waiting on a bench with a small suitcase. But they all seemed too caught up in their own worlds, their minds probably already at home with their families.\n\nMahaira glanced at her watch, her heart pounding in her chest. The hands seemed to move slower with each passing second. But there was no sign of Eshan. She couldn't help but feel a wave of anxiety wash over her, her mind racing with all sorts of possibilities.\n\nWas Eshan going to come? She found herself asking this question over and over again, each time the answer seeming more uncertain. She remembered how he had denied eloping before her marriage, the memory still fresh in her mind. Would he do it again? She couldn't help but wonder.\n\nShe shook her head, trying to clear her thoughts. She had to stay positive, had to believe that Eshan would come. She had come this far, she couldn't afford to lose hope now. So, she sat there on the bench, her eyes fixed on the entrance of the station, waiting for Eshan. \n\nWith just half an hour left for the train, Mahaira's restlessness grew. She had called Eshan a few times, but each call was met with the same, frustrating silence. The crowd of people had thinned out by now, and she found herself scanning the faces of the few that remained, hoping to catch a glimpse of Eshan.\n\nSuddenly, her heart skipped a beat. There he was, Eshan, hurrying towards the entrance of the station. He was carrying something large and rectangular, wrapped in newspaper. A wave of relief washed over her. She stood up, her heart pounding in her chest, and waved at him. Her journey was about to begin.\n\nEshan hurried towards her, panting heavily. “Eshan, are you okay?” Mahaira asked, concern etched on her face. Eshan didn't respond immediately, catching his breath instead.\n\nFinally, he looked at her, his eyes sad. “Mahaira,” he began, his voice barely above a whisper, “I... I can't go with you today.”\n\nMahaira felt as if the ground beneath her had given way. Her world seemed to stop, the noise of the station fading into a distant hum. She stared at Eshan, her mind struggling to comprehend his words. The wait, the anxiety, the hope - it all seemed to crash down around her. She stood there, frozen, as the reality of Eshan's words slowly sank in.\n\n\n\nTo be continued...\n\n\n\nThis was a lame episode. The story didn't progress much, just a bunch of descriptions.\n\n\n#betrayal #love #escape #decision #emotions #turmoil #anticipation","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/art-deception-2-evening-sun-began-set-mahaira-could-feel-it-csvixn","p":"csu0cx","n":"csvryt"}