{"d":"2024-02-17T11:29:33Z","t":"A Friend in Deed  1\n\n\nKairav had just left his office and was on his way down in the elevator. The day had been long and his face showed it. Gargi, who was in the elevator with him, noticed his gloomy expression.\n\n“Kairav, why the long face?” she asked, her voice filled with concern.\n\n                                                    cont...","c":"#a_friend_in_deed  1\n\nKairav had just left his office and was on his way down in the elevator. The day had been long and his face showed it. Gargi, who was in the elevator with him, noticed his gloomy expression.\n\n“Kairav, why the long face?” she asked, her voice filled with concern.\n\nKairav looked at her, a bit taken aback. He managed a weak smile and said, “It's nothing, Gargi. Just heading home.”\n\nGargi wasn't convinced. She knew Kairav better than that. She decided to push a little further. “Is it about Neha?” she asked gently. “Are you ever going to tell her how you feel?”\n\nKairav's face hardened. “That's none of your business, Gargi,” he snapped.\n\nGargi didn't take offense. She understood Kairav's frustration. “Kairav, don't be angry,” she said calmly. “You're always talking about Neha. It's clear how much you care about her.” She paused for a moment, then added, “I wonder if Neha feels the same way about you. Do you think she might love you too?”\n\nThe elevator door slid open with a soft ding. Kairav stepped out without a word, leaving Gargi behind. He was eager to get back to his flat and escape into the solace of sleep. His mind was a whirlwind of thoughts, all centered around Neha. It had been a week since he had last spoken to her. No calls, no messages on Whatsapp, not even a simple SMS. Her phone was switched off and she was offline. It was as if she had vanished into thin air.\n\nEvery day, while commuting to and from the office, Kairav would stand in front of Neha's house, hoping to catch a glimpse of her. But there was no sign of her. Neha's sudden disappearance was deeply concerning for him. He couldn't help but worry about her.\n\nWhen he finally reached his flat, his roommate looked up from his laptop. “Why are you late, Kairav?” he asked. Their flat was a small studio room, shared between the two of them. The rent was exorbitant, but that was the price to pay for living in the city.\n\nKairav was taken aback by his roommate's next words. “Neha was here,” he said casually. “She was waiting for you. She left a gift for you when she left.”\n\nKairav, with a sense of urgency, quickly sat down on the bed. It was the only piece of furniture in the room that could be called decent. He held a packet in his hands and opened it. Inside was a blue dress. He held the dress in his hands, looking at it for a while. He was puzzled. Neha had been waiting for him, but why hadn't she called him? And why had she given him a new dress?\n\nHis thoughts were interrupted by the sight of a letter tucked inside the packet. It was clearly written in Neha's handwriting. With a sense of trepidation, he began to read the letter.\n\nDear Kairav,\nI wanted to tell you that my marriage has been arranged recently. I've been busy with shopping and making all the arrangements, so I didn't get a chance to talk to you. But you are a good friend, and I couldn't forget about you. I bought this dress for you, knowing your situation. I would like you to come to the wedding wearing this dress. The wedding is tomorrow at La Roma Gardenia. Please, do come. You are a very special person to me, and some people are too special to be invited with just a wedding card. Please come.\n-Neha\n\nKairav sat on the bed, his heart heavy with a sense of loss. The woman he had silently loved for years was about to become someone else's. He couldn't blame Neha, though. He had never expressed his feelings to her. He had wanted to, many times, but he just couldn't find the courage. He had assumed that maybe she liked him too since she didn't have a boyfriend.\n\nNeha was from a different world, a world far above his own. Kairav was just a simple man, struggling to make ends meet. His monthly salary barely covered his expenses. After sending money home, paying the rent, and setting aside a little for food, he was left with nothing. He was already in debt.\n\nTheir meeting had been a chance encounter on a train when he was moving to the city. Neha, who already lived in the city, was returning from a trip. They had ended up sitting opposite each other, and Kairav found himself stealing glances at her. Neha had noticed his gaze.\n\n“Hi, how are you?” Neha asked him after a while.\n\nKairav, caught off guard, stuttered, “Um, I'm good. Do I know you?”\n\nNeha laughed lightly, “Well, you've been looking at me. I thought maybe you did.”\n\nKairav blushed, “Oh, it's nothing like that.”\n\n“So, you just like staring at beautiful girls?” Neha teased.\n\nKairav stammered, “Uh, I...I just liked your eyes.”\n\nNeha laughed again, “What a cliche line! Where are you headed?”\n\n“Bangalore,” Kairav replied.\n\n“Oh, I live there too,” Neha said, “By the way, my name is Niharika, but everyone just calls me Neha.”\n\n“I'm Kairav,” he said, introducing himself.\n\nThat's how their friendship blossomed. They got to know each other better and grew closer with time. Kairav's roommate and office colleagues often told him, “If you have a good female friend, you don't need a girlfriend. But the problem arises when you fall in love with her, and if the feelings are not reciprocated, then that pain is the worst.”\n\nKairav remembered a quote by Dave Matthews, “A guy and a girl can be just friends, but at one point or another, they will fall for each other.”\n\n\n\nTo be continued...\n\n\nBackground created with Imagen.\n\n#unrequitedlove #friendship #heartbreak #longing #emotions #fate #regret","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/friend-deed-1-kairav-had-just-left-his-office-his-way-down-cta5ia","p":"cs95u5","n":"ctbaon"}