{"d":"2024-02-17T20:23:27Z","t":"A Friend in Deed  2\n\n\nThe clock struck 10. Kairav found himself standing in front of Neha's house, a towering ten-storey building. Neha's family lived on rent in one of the floors. The entire building was adorned with tiny LED lights, giving it a festive look. A small pandal had been set up, and a red carpet was laid out, indicating a celebration.\n\n                                                    cont...","c":"#a_friend_in_deed  2\n\nThe clock struck 10. Kairav found himself standing in front of Neha's house, a towering ten-storey building. Neha's family lived on rent in one of the floors. The entire building was adorned with tiny LED lights, giving it a festive look. A small pandal had been set up, and a red carpet was laid out, indicating a celebration.\n\nA sign with hearts caught his attention. It read 'Neha weds ...', but Kairav couldn't make out the rest. His vision blurred as tears welled up in his eyes. He tried to call Neha, but her phone was switched off.\n\nThe weather in Bangalore was usually pleasant, but not today. As if mirroring Kairav's emotional turmoil, it started to drizzle. Kairav moved across the street and took shelter under a shop awning, his gaze still fixed on Neha's house. He stood there, lost in his thoughts, as the raindrops gently pattered around him.\n\nA while later, Kairav's phone rang. It was Neha. She must have spotted him from her window. He answered the call, his voice trembling slightly.\n\n“Hey, Neha. How are you?” Kairav asked, trying to sound casual.\n\n“I'm good, Kairav. But why are you standing outside? Why don't you come in?” Neha barraged him with questions. “Did you receive the gift?”\n\n“I...I received your gift,” Kairav stammered, “That's why I came. I wanted to tell you something.”\n\n“Oh, you want to tell me something?” Neha asked, “Can it wait? Today's a busy day.”\n\n“No, it can't wait,” Kairav insisted, “I need to tell you today. Any other day won't be possible.”\n\n“What is it that you want to say?” Neha asked, her voice filled with curiosity.\n\n“I...I want to say it face to face,” Kairav said, pleadingly, “Can you meet me?”\n\n“Alright,” Neha agreed, “Come inside the compound and wait. I'll come down.”\n\nKairav proceeded towards the building. He was feeling cold because of the rain and was shivering. Maybe it was also because he was afraid and anxious about what was about to happen.\n\nKairav waited anxiously, his heart pounding in his chest. After what felt like an eternity, Neha finally came down, carrying an umbrella. She looked at him, her eyes filled with concern.\n\n“Didn't bring an umbrella, huh?” she asked, her voice soft.\n\n“I...I didn't think it was going to rain,” Kairav replied, his voice barely above a whisper.\n\nNeha moved closer to him, sharing her umbrella. They stood there, so close to each other, under the same umbrella, yet feeling miles apart. The silence between them was deafening.\n\n“So, what did you want to say?” Neha finally broke the silence.\n\n“Are you...are you really getting married?” Kairav asked, his voice trembling.\n\nNeha laughed, “You're an idiot, Kairav. Can't you see the decorations?”\n\n“I saw them,” Kairav admitted, “But my heart refuses to understand.”\n\n“What do you mean?” Neha asked, her laughter fading away.\n\nKairav swallowed hard. “I...I love you, Neha,” he confessed, his voice choked with emotion, “I've loved you for a long time, but I couldn't say anything because I didn't want to ruin our friendship.”\n\n“But why are you telling me this now?” Neha asked, her voice barely a whisper, “I'm getting married tomorrow.”\n\n“I know,” Kairav said, his voice filled with sadness, “I can probably live without you, but I won't be able to live well. You've become a part of my life.”\n\n“But I've always been just a friend to you, Kairav,” Neha said, her voice filled with confusion, “I've always tried to help you improve your life.”\n\n“I know,” Kairav said, his voice filled with desperation, “But if you leave, my life will worsen again. No one else will understand me like you do.” His voice trailed off, leaving them in a silence that was only broken by the soft patter of the rain.\n\nNeha sighed, her eyes filled with pain. “Kairav, you don't understand. My marriage is fixed now. I can't just run away with you. That would hurt my parents so much. I can't be selfish and break their hearts.”\n\nKairav remained silent, his eyes fixed on the ground. He felt a lump in his throat, but he couldn't say anything.\n\nNeha shook her head, her voice filled with regret. “Why didn't you tell me before, Kairav? Why did you wait till the last moment? Maybe then we could have talked about it. Maybe then things could have been different.”\n\nKairav was silent again, his mind blank.\n\nNeha looked at him, her voice filled with pity. “Kairav, please. You have to be strong. Go back to your flat. Rest. And tomorrow, come to the venue. Wear the dress I gave you. Now, smile.”\n\nKairav was silent, but there were tears in his eyes. He couldn't look at her.\n\nNeha reached out, her voice filled with sadness. “Kairav, take the umbrella. Go. It's late. I have to go inside. I don't want anyone to see us like this. Please, Kairav. Go.” She handed the umbrella to Kairav and started walking to the building.\n\nNeha had barely taken a few steps when Kairav dropped the umbrella. He ran to her, his heart pounding in his chest, and hugged her from behind. He turned her around and looked into her eyes. “Please, Neha,” he pleaded, “Think about this again.”\n\nThey stood there in the rain, their bodies close, their hearts aching. Were they crying? The rain made it impossible to tell.\n\nAfter a while, Neha gently pulled away from him. “Kairav,” she said, her voice barely above a whisper, “You need to go back to your room. Eat something. Sleep.” She paused, looking at him with concern. “Is there anything cooked at your place, or should I pack something for you?”\n\nKairav shook his head, “No, it's not needed.”\n\nNeha gave him a stern look. “Don't be silly, Kairav. Wait here.” She went inside and after a few moments, she returned with a tiffin box. “This is the last time you'll be eating my food, Kairav,” she said, her voice filled with sadness.\n\nKairav rubbed his eyes, trying to hold back his tears. Neha smiled drily, “You know, I've given you so many tiffin boxes, Kairav. You never returned any of them. I'll have to buy new ones now.”\n\nKairav managed a weak smile. “I always felt shy returning an empty box.”\n\nNeha smiled back at him. “That's not a problem, Kairav. Take the box. And the umbrella. You'll catch a cold if you stay out in the rain. Now go, and be careful.” With that, she turned around and walked away, leaving Kairav standing alone in the rain, his heart heavy with unspoken words and unfulfilled dreams. The umbrella in his hand felt heavy, just like his heart. The rain continued to pour, washing away his silent tears, but not his heartbreak.\n\n\nKairav lay on his bed, staring at the ceiling. Sleep was a distant dream. How could he possibly sleep when the woman he loved was getting married the next day? The thought was like a sharp knife, cutting through his heart. He would never hear her voice again, the early morning calls, the good morning messages, the funny memes and videos. He would never share a laugh with her again, over those corny or naughty jokes that only they understood. He would never taste the food she would send over whenever he was too lazy to cook. No one would ever force him to get out more, to explore the city with her.\n\nHe had never imagined that one day, all these little things that he took for granted would disappear. He had realized how much he missed her, how much he needed her, when she stopped contacting him for a week. But now, he was facing the prospect of no contact for a month, a year, a decade, or even more. The thought was unbearable.\n\nHe knew he had chosen the wrong path, wasted his chance. Yet, he found a strange peace in having confessed his feelings to Neha before her marriage. He hoped that she would remember him. He yearned for a partner who could understand his unspoken troubles, see through his silence.\n\nThe heartless world cares not for anyone's desires, nor for the emotions that stir in the soul. If it did, those who loved sincerely would not have to cry themselves to sleep in sorrow.\n\n\n\nTo be continued...\n\n\n#confession #love #friendship #heartbreak #rain #regret #unrequitedlove","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/friend-deed-2-clock-struck-10-kairav-found-himself-standing-ctbaon","p":"cta5ia","n":"ctbkai"}