{"d":"2024-05-12T18:38:42Z","t":"                      Marigold\n\nKavya, or should we say Goldy, was tired. She was tired of these new walls, these new chores, and this new life. But most of all, she was tired of her new name. It wasn't her choice, it was given to her. After her marriage, she was no longer Kavya. She was now Goldy, a name chosen by Mary.\n\n                                                   cont...","c":"Marigold\n\n\nKavya, or should we say Goldy, was tired. She was tired of these new walls, these new chores, and this new life. But most of all, she was tired of her new name. It wasn't her choice, it was given to her. After her marriage, she was no longer Kavya. She was now Goldy, a name chosen by Mary, the elder daughter-in-law of the family.\n\nMary, with her air of authority, had decided that Goldy was a better fit. It was a name that, in her opinion, carried more weight, more prestige. But why was Goldy better than Kavya? They both had the same number of letters. Yet, to Mary and the rest of the family, Goldy was superior. It was a notion that added to her growing list of grievances.\n\nIt had only been a month since Kavya had become a part of this family. The marriage was arranged. The family she married into was wealthy, their affluence evident in the ten-story building they owned in the heart of the city. They resided in the penthouse, the topmost floor, while the rest of the floors were rented out.\n\nHer husband was an engineer. He had an elder brother who was the caretaker of the family business. The elder brother's wife, Mary, was a figure that Kavya found hard to admire. She was a doctor. There was also a sister, but she was already married and had moved away.\n\nKavya was a well-educated woman. She could have pursued a career just like Mary, but her in-laws had other plans. Before the wedding, they had made it clear that they wanted a bride who would stay at home, and her parents had agreed to this condition.\n\nSince Mary, the elder daughter-in-law, was unable to contribute to the household chores due to her profession, Kavya was expected to pick up the slack. She was essentially brought in as the household workhorse, a role that she found deeply unsettling.\n\nMary's demeanor only added to her discomfort. As she would leave for the hospital, she would casually ask, “Goldy, do you need anything?” During lunchtime, she would call, “Has everyone at home eaten?” It was as if without her supervision, no one would eat. Kavya found this attitude unbearable.\n\nMary had been married for four years, but she had been unable to conceive a child. So she was brought into the family, Kavya thought - to bear a child, as a 'baby-making machine.' Kavya couldn't help but wonder, if Mary couldn't have a child, why didn't they just divorce her and find a new wife for the elder brother? Why did Kavya have to marry the younger brother?\n\nThese thoughts often crossed Kavya's mind, but she had made a decision. She would soon give birth to a child and secure her place in everyone's heart. After all, it wasn't as if the family was dependent on Mary's income. Mary mostly used her earnings for her personal expenses. She would occasionally bring home some necessities or medicines when returning from work, but that was it.\n\nKavya seethed every evening when Mary, a 'snake', as she liked to call her, returned home laden with small gifts. It was all a ploy, Kavya was sure of it - a desperate attempt to win over the family since she couldn't give them a grandchild. Kavya smirked internally. In a few short months, she'd deliver her own child and solidify her place in the family.\n\nAnd indeed, a few days later, Kavya's joy knew no bounds when she learned she was pregnant. But elation soon turned into simmering resentment. Mary, ever the picture of fake concern, became a constant presence, hovering over Kavya with a never-ending stream of advice. “Goldy, you shouldn't lift that,” Mary would chirp, her voice dripping with saccharine sweetness. Or, “Honey, those cravings aren't an excuse to eat sweets! Have some fruit instead. The doctor wouldn't approve.”\n\nKavya would clench her jaw, forced to smile politely. Every helpful suggestion, every bit of advice, felt like a thinly veiled attempt to control her. The woman was like a fly buzzing around her head, and Kavya just wanted to swat her away.\n\nKavya's husband was often busy with his job. So, Mary became the self-appointed guardian of Kavya's pregnancy. She'd schedule doctor's appointments, pick Kavya up for them, and even hover during the ultrasounds, her gaze glued to the screen alongside Kavya's.\n\nAfter work each day, that serpent would slither into Kavya's room, arms laden with gifts as if Kavya were her own dear sister. Fruits, prenatal vitamins, soft blankets - Mary brought them all, wearing a saccharine smile that made Kavya's skin crawl. Kavya fantasized about slaughtering this highly irritating pest with her bare hands.\n\nOne day, Kavya's mother-in-law approached her. “Goldy, you don't need to go to the kitchen anymore,” she said.\n\nKavya was surprised. “Why, mom?”\n\n“Mary has arranged for a cook,” her mother-in-law explained. “You need rest these days. Eat healthy foods. Now go to your room and rest. Maybe take a short walk in the evening and follow the doctor's instructions.”\n\n“Did sister-in-law tell you to do these things?” Kavya asked cautiously.\n\n“Yes, Goldy,” her mother-in-law confirmed. “Just yesterday she spoke with your gynecologist. We don't understand these matters as well as she does, being a doctor herself. We just want you to have a healthy baby, whether a boy or a girl.”\n\nAt first, Kavya was feeling reassured hearing her mother-in-law's words. But the moment Mary's name was mentioned, rage bubbled up inside her once again. She abruptly left the kitchen area.\n\nWhat was this Mary even trying to do? Kavya fumed to herself. Was she going to try instructing Kavya on how to raise her own baby too? If Mary so much as dared give another piece of unsolicited advice, Kavya vowed, she would shout at the woman to go have her own baby instead.\n\nMonths passed, and Kavya finally gave birth to a beautiful baby girl at the large hospital where Mary worked. Now Mary's joy knew no bounds. She was constantly present, fussing over the newborn.\n\n“Don't you have patients to see?” Kavya asked her, exasperated.\n\n“Why not take some time, Goldy?” Mary replied breezily. “Patients will always be there. But I've taken leave now.”\n\n“But why did you take leave?” Kavya emphasized the 'you', eyes narrowing.\n\n“Oh dear, what are you saying?” Mary clucked her tongue. “You just gave birth. You can't be expected to handle everything with the baby right now. Someone has to assist you.”\n\n“Mother is here,” Kavya pointed out.\n\nMary waved a dismissive hand. “She's old, let her be. Oh look, Aarna is crying - you should feed her.”\n\nKavya stared at her, eyes blazing red. “Who named her Aarna?”\n\n“Why, I've named your daughter Aarna,” Mary said with a smile. “Isn't it just beautiful?”\n\nThe audacity of this woman! Kavya thought, indignant rage building inside her. Was this witch actually trying to name her baby? Did she honestly think she could appoint herself the child's mother?\n\nActually, within a month, Mary did become the child's mother - by circumstance rather than assumption. She had to leave her job, as handling a newborn is never easy.\n\nOne fateful day, Kavya had gone up to the rooftop to hang clothes out for drying. Since there were no other young children in the household, no safety railing had been installed along the roof's edge. In a horrible accident, Kavya slipped and plummeted ten floors down to the unforgiving ground below. She was gone before they could even get her to the hospital.\n\nLittle Aarna was left wailing in Mary's arms that day. From that moment on, Mary seamlessly stepped into the role of mother - the one job that still mattered after resigning from the hospital.\n\nIn the quiet of the night, when Aarna's cries pierces the silence, Mary wakes up. She rises, weary but determined, to comfort the little one. With gentle hands, she soothes her, feeds her, and rocks her back into a peaceful slumber. The house settles back into stillness, save for the soft whispers of Mary's lullabies.\n\nHowever, there are nights when the silence remains unbroken, and yet, Mary finds herself awake. In the darkness, her thoughts drifts to that tragic day. Did anyone witness her leaving the roof after Kavya's fall?\n\n\n\nBackground created with Dall-E.\n\n#arrangedmarriage #pregnancy #resentment #tragedy #mystery #identity #family #twist","f":"i","l":["hor","lif"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/marigold-kavya-should-say-goldy-tired-she-tired-these-new-it-ctx5xr","p":"ctxpgt","n":"ct0x24"}