{"d":"2024-06-30T12:42:56Z","t":"It was two in the morning. I was sitting in my hostel room, eyes glued to my laptop screen, watching episode after episode of my favorite show. Suddenly, I heard a knock on my door.\n\n                                                  cont...","c":"It was two in the morning. I was sitting in my hostel room, eyes glued to my laptop screen, watching episode after episode of my favorite show. Suddenly, I heard a knock on my door.\n\n\"Who could it be at this hour?\" I mumbled to myself as I got up to open the door.\n\nTo my surprise, it was Chandan-da, our hostel's caretaker, standing there. He was holding a small bag filled with some snacks.\n\n\"Chandan-da?\" I asked, rubbing my eyes. \"I thought you were going home today for the Diwali break.\"\n\nChandan-da gave me an odd smile. \"The hostel is closing tomorrow for the holidays. You and one other boy are the only ones left here. I thought I should bring you some food.\"\n\nI looked at him more carefully. Something about his appearance seemed different. His eyes were cloudy, unfocused. As my gaze traveled down his body, I froze. He was covered in blood. His clothes were torn and bloodstained. His arms and legs had deep gashes, and his skin looked unnaturally pale.\n\nWith shaky hands, I took the bag from him and asked, \"Are... are you okay, Chandan-da? Why are you all bloody?\"\n\nChandan-da just stared at me blankly for a while. Then he said, \"Can you do me a favor? Can you call my family and give them a message?\"\n\n\"What message?\" I asked, feeling confused and scared.\n\n\"Please tell them I'm on Highway 34,\" Chandan-da said in a flat voice. \"Ask them to look for me carefully inside the overturned bus. The glass and metal in my body... they are starting to bother me now.\"\n\nBefore I could say anything, Chandan-da turned around and seemed to float toward the main gate. He passed silently through the closed gate. I stood there for a long time, staring at the gate. I looked down at the food packets in my hand. \"Should I eat this?\" I wondered.\n\n\n\nImage created with Imagen.\n\n#ghost #paranormal #midnight #highway #supernatural #eerie #apparition #liminal","f":"i","l":["hor","lif"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/it-two-morning-i-sitting-my-hostel-room-eyes-glued-my-laptop-cub5od","p":"cubxri","n":"cufyqr"}