{"d":"2024-09-22T12:51:50Z","t":"I'm sitting in the back of the ambulance, staring at my best friend, my roommate. His body lies still beside me. It feels unreal, like everything is happening too fast. Just days ago, we were talking, and now he's gone. I can't believe I'm the one taking him back home.\n                                                        cont...","c":"I'm sitting in the back of the ambulance, staring at my best friend, my roommate. His body lies still beside me. It feels unreal, like everything is happening too fast. Just days ago, we were talking, and now he's gone. I can't believe I'm the one taking him back home.\n\nThe sirens wail above, but my mind is somewhere else. I feel numb, as if the world has gone quiet around me. Then, suddenly, ping, my phone buzzes. I pull it out of my pocket, and it's a message on WhatsApp. I glance at the screen and see it's from Afsana - multiple messages.\n\nI had forgotten about my phone while we were at the hospital. I wasn't thinking about anything else. My friend was all I could focus on.\n\nI open the messages from Afsana and start reading. My heart sinks as I take in her words:\n\n\"I'm so sorry. Please forgive me. My father, who I was always afraid of and could never talk back to, fell to his knees in front of me. I couldn't say no. His love felt stronger than yours then. I've been married to someone else for a week now.\n\nI used to say I'd never leave you. I was scared you'd hurt me or marry someone else. But look, I'm the one who got married and hurt you. Life is strange, isn't it? Remember how I'd cry and ask if you'd leave me? You'd smile and say you wouldn't, but maybe I would. That made me mad because I loved you so much. I never thought I could live without you. But now someone else is in your place.\n\nIt all happened so fast. That's why I stopped talking to you, turned off my phone, and deleted all my online accounts. I know you're hurting. I hurt the person I wanted to spend my life with. My family is happy. My husband seems good for now, but who knows about later.\n\nDo you remember the last time we met? I didn't know it would be our last. We spent the whole day together, right? When you helped me into the cab and held out your hand, I didn't want to let go. As the cab drove off, I let go of your hand, and with it, my love and dreams.\n\nYou must still have the clothes you bought for me. Well, I'm not yours anymore. Can I have those clothes? You'd always buy things you liked for me, and I'd say I'd take them all after we got married. Now I'm married, but not to you. I never thought this would happen.\n\nPlease marry someone you like. Give her all those things. I'm going to disconnect this number for good. We won't talk again after today. I have one request. If we ever see each other on the street, please walk by like a stranger. Take care of yourself. Get your life sorted out. We only have one life. I hope you're okay. I'm not.\"\n\nTears well up in my eyes, and I can't tell if it's because of the message or the sight of my best friend's body in front of me. My hands shake as I type a reply. \"Don't worry about me. Focus on your life with your husband. Marriage is the strongest bond there is. I hope you stay happy and well. Take care.\"\n\nI hit send, staring blankly at the screen. A moment later, her reply comes through. \"Thank you for forgiving me so easily. Please don't contact me again. Goodbye. You'll always have a place in my heart.\"\n\nMy best friend lies in front of me, sleeping his forever sleep. I stare at him, trying to make sense of it all. It was almost a week ago when he came home from work, fuming with anger. His phone smashed into pieces after he threw it against the wall. He was frustrated because Afsana hadn't contacted him for days. He couldn't understand why, and it ate at him.\n\nThe phone was beyond repair. I remember him looking at the broken pieces with a mix of regret and rage. He handed me his SIM card and asked to use my phone, opening a second space for his accounts. \"I'll buy a new phone only after she contacts me,\" he said. But that call never came.\n\nMaybe he was too distracted when the accident happened, his mind filled with thoughts of Afsana and the silence that grew between them. The accident wasn't severe, or at least, it didn't seem that way at first. He was taken to the hospital, but something inside him had already given up. He lost the will to fight, to live. The doctors tried - again and again, they tried - but nothing worked.\n\nThis morning, he was gone.\n\nI think about how he never found out. He never knew that Afsana had married someone else. Maybe it's better that way. What good would it have done for him to know that she had moved on? That she had chosen someone else over him while he clung to hope, waiting for a message that would never come?\n\nAnd Afsana - what would she gain from knowing the truth? That the man she left behind is no longer alive? No, I won't tell her. There's no point in breaking her heart now that she's just begun her new life. What good would it do to shatter the happiness she's found?\n\nLet her think he's doing well, that he's happy too. Maybe someday, when she's alone with her thoughts, she'll wonder about him. Maybe she'll imagine him with a wife, laughing, living the life she thought she would have. She might even think that the gifts he bought for her are now being used by someone else. And in her mind, he'll be fine.\n\nThe ambulance slows to a stop, having reached its destination. I look down at my phone one last time, Afsana's chat still open. Before slipping the phone into my pocket, I type out one final message from my friend's account:\n\n\"I hope you find happiness in your new life. Take care, and goodbye.\"\n\nI hit send, watching as the message appears on the screen. It stays there, a single tick next to it. Undelivered. Unseen.\n\n\n\nBackground created with DallE-3.\n\n#grief #loss #farewell #heartbreak #accident #messages #friendship #undelivered","f":"i","l":["fds","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-m-sitting-back-ambulance-staring-my-best-friend-my-his-me-cuzxh8","p":"cuvsi5","n":"cvjuaf"}