{"d":"2019-05-31T06:17:59Z","t":"I made a machine that can teleport you to a world where everything is opposite.\n                         There:\n• Criminals make laws.\n• Banks rob people.\n• The government tricks people.\n• Police kill the innocent.\n• Rape victims are assumed to be at\n   fault.\n\nBut wait, why am I even telling you this?\nYou already live in that world.\n\n","c":"Don't you? Don't you already live in that world?\n\n\nIf you're reading this then here's what happened. A few days back, I guess, a picture surfaced on social media about 'someone' from Pakistan standing on an Indian flag. Some Indian started spreading it with captions like, “Make this VIRAL such that it reaches Modi. Pakistan should be punished for what they did.” etc.\n\nNow, I do respect their thoughts and their love for their motherland, but I've something to say against this.\nLet's take an extreme example, don't roast me.\nSay, some people raped a girl, made a video, and put it on the internet. Now, will you post that video everywhere saying, “that girl should get justice, those people(?) should be punished...”? Probably not.\nThat 'someone' from Pakistan did a dirty job. They put it up on the internet to disrespect India. They wanted it to go VIRAL. If it's against India, than why are the Indians helping them by making it VIRAL?\n\nMy request to you is, if you've taken part, or have seen someone take part, in this 'fake love for motherland', please take the picture down or ask them to take it down mentioning the above reasons.\n\nNow, I'm aware that even I'm 'spreading' this news and somehow going against what I just said. So you're welcome to roast me on that. And, if you're still reading, you may comment your views.\n\n\n\n\n\n#machine #teleport #opposite #world #hypocritesociety #oppositedecisions #oppositethoughts #fakepeople","f":"i","l":["hor","pts"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-made-machine-teleport-you-world-where-everything-opposite-qyexu","p":"qwzmu","n":"qyg7u"}