{"d":"2019-06-10T07:20:32Z","t":"I'm the NICEST PERSON for my daughter.\nAnd I just need to reach home.\n\n\n\n---Read in caption---\n\n","c":"I drove off without looking back, my head swimming and vision blurred. I tried to concentrate on the road, on the dashed white line in the middle of the highway that, I knew, would take me home.\n\nI must've taken a wrong turn somewhere as I found myself back at the intersection. Some people have gathered there. A stretcher had been wheeled out. I ignored them as I steered back on the highway, to get home to my daughter, my little angel.\n“He's the nicest person in the world,” she always tells. Tomorrow's my daughter's birthday. She'd be really happy with her gift. I looked beside me; the gift was wrapped in a blue cover, waiting on the seat to be opened by my daughter. I pressed on the accelerator concentrating on the road and came back at the intersection.\n\nSurprised, I stopped my car. More people have gathered around now. I recognized some of their faces. Sirens wailed in the distance. The clock on the dashboard displayed 11:30 PM. I concentrated back on the road to reach home.\nThe cold night air refreshed me taking my mind away from the accident on the intersection. I hope no one saw me there. It really wouldn't be a nice experience to face my daughter with the guilt.\n\nI really should have been concentrating on the road, as I came back at the intersection, this time much quicker than before. My world was getting smaller. An ambulance was waiting. People were helping the attendants get the body in the back.\n\nI looked ahead of me in the highway, it leads to another intersection which leads to another and another into the distance. In each of the intersections, I saw my car in the middle, my drunk face behind the wheels.\n\nThis was my world now, an intersection, these people, the flashing siren and a blue box with red stains lying on the ground.\n\n\n\n\n\n#Collab and write a short story in two to three paragraphs titled #niceguy #YourQuoteAndMine\nCollaborating with YourQuote Baba\n\n\n\n#accident #siren #drunkdriving #death #hopeless","f":"i","m":[[1890,1904]],"l":["hor","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-m-nicest-person-my-daughter-i-just-need-reach-home-read-reszc","p":"repam","n":"rf7hd"}