{"d":"2019-07-26T03:15:40Z","t":"\n\nI'm afraid to sleep. I need to look out for the Finders.\n\n\nWhy is it that running away from your loved ones hurts the most?\n\n\n\n—————READ IN CAPTION—————\n","c":"Day 5:\nFinally reached satellite station. Found a gun. Need to fix the generator and bolt down the door. Can't open it for Sarah.\n\nDay 6:\nGenerator working but low on fuel. I can spot the Finders in the surrounding field walking aimlessly. Satellite spots many more.\nThat might be Sarah in the satellite image, but it's blurry. No Hiders around, no sign of anyone unaffected by the plague.\n\nDay 7:\nSaw a Hider running in the field chased by a Finder. He tripped and fell. He begged, “Julia, please! Stop. You're sick.” She just smiled like a child, “Ready or not, here I come”. Couldn't watch the killing.\nReminder: Bolt down the door.\n\nDay 8:\nFuel reserve at 20%. Spotted Sarah again, image was much clear. She was nearing the station.\nSpent last night crying. We two were so happy together, but just a week before, the plague hit. It generally affected the females, but in some cases also the males. It turned them violent towards their loved ones. We call them Finders, no matter how hard we try to hide, they seem to always find us.\n\nDay 9:\nDefinitely Sarah, 15km and closing. Fuel reserve at 10%. Should conserve power, but can't. I know she'll kill me, but watching her is comforting.\n\nDay 10:\nFuel depleted. Sarah 5km away. Still haven't bolted down the door. Why not? Maybe because of the love. Can Hiders fight back and kill their Finder? Kept the gun loaded, just in case.\n\nDay 11:\nWatching Sarah approaching through the binoculars. She looks thin and pale. Gun is ready.\n\nI hear her outside. I open the door and go outside pointing the gun at her. She tries to speak.\n“Ready or not”, I smile childishly, “here I come!”\n\n\n\n\n\n#Whyareyouawake? Collab. #YourQuoteAndMine\nCollaborating with YourQuote Baba\n\n\n\n\n\n#hiding #plague #disease #lovedones #violent #kills\n\n\n\n\n\nJust to clarify, you did get the twist, didn't you?","f":"i","m":[[1697,1711]],"l":["hor","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-m-afraid-sleep-i-need-look-out-finders-why-it-running-away-tdxh5","p":"tcb65","n":"tfjhy"}