{"d":"2019-09-03T03:19:39Z","t":"Insanity means doing something over and over while expecting different results.\n\nSo, was I going insane for the doll?\n\n\nRead this\nHORROR-INSPIRATIONAL\nstory in caption","c":"I never gave any importance to the man's warnings. After all, what could have gone wrong if I repeated the forbidden name?\nSimilarly, I never gave any importance when the doorbell rang. There wasn't anyone outside except a box. Who could have sent this, I thought, as I opened the box. There was a doll inside; I never could have imagined that this was what the man was talking about.\n\nThe doll wasn't one of the most beautiful ones out there, but it had a magical charm about it. It looked creepy, but at the same time one couldn't take their eyes away from it. It looked really nice on the fireplace.\nAnd then things started going bad. The doll would end up in odd places without anyone moving it around. Strange sounds could be heard throughout the night. I had a few frequent accidents and the doll somehow ended up nearby. Only one conclusion was possible. The doll was haunted, demon possessed. Possessed by the one whose name must not be taken.\n\nI had to get rid of it, I thought, as I decided to bury the doll. I took it outside into the garden, dug a hole and buried it. I also sprinkled some holy water. That's the end of it; I was relieved.\nWTF, I was surprised when I came back inside. The doll was still resting on the fireplace. I had to do it again. I took it outside and buried it again. And I came back inside to find it again.\n\nThe next idea was to throw it in the nearby river. And that I did. But still, when I returned home, you've guessed it right, the doll was still in my house. I tried to take it to the woods, but it still didn't go away. I tried to burn it, and it returned.\nI wasn't afraid anymore, I was going insane. The doll never ended, as if it had an infinite supply.\n\n\nAnd then the idea stuck me. It was winter now. One evening I was out of woods for the fireplace. In my insanity I put the doll in the fireplace and put it on fire and went around with my work. When I returned there was a new doll on the fireplace. So I threw that too. And I'd just solved my problem, living off of the infinite supply of regenerating dolls.\n\nWithin spring I'd installed a boiler in my house. Now I'd free electricity, burning the doll. Within summer I started providing cheap electricity to my neighbors. I was right, I'm no longer afraid. And now I wasn't insane too.\nA few neighbors aren't still comfortable living on hellfire, but who cares; the majority is okay with it.\n\nWHEN LIFE GIVES YOU DEMONS, GIVE THEM HELL.\n\n\n\n\n\n#possessed #doll #horror #noend #burn #inspiration #demons #hell","f":"i","l":["hor","ins"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/insanity-means-doing-something-over-over-expecting-different-u1su3","p":"uz9qb","n":"u3brd"}