{"d":"2020-02-25T05:19:03Z","t":"REFLECTION\n                                              \n\n\n\n\n\n\n","c":"It all started today morning. I was standing in front of the basin brushing my teeth, when my roommate, Sandip came in. I was bent over the basin, scooping water in my mouth.\n\n“You're going to Sabiha's birthday party this afternoon, right?” he asked. Sabiha was my sister; we’re not siblings, but that doesn't matter. She will be hosting a poolside party for her 16th birthday.\n\nI spit into the basin. “Of course, I can’t be missing that,” I replied, splashing water on my face and looking up at the mirror. That's when I saw it and shrieked in horror. Sandip’s face, reflected in the mirror, was disfigured, bloodied and full of scars.\n\n“What’s wrong?” Sandip asked. I looked back slowly at Sandip, who was just trimming his beard. He appeared normal. I looked back at his reflection on the mirror. It was also now normal.\n\n“S... Sorry about that. I just remembered that I needed to submit an assignment, and haven’t done it.” I tried to laugh but just coughed instead. “What about you?”\n\n“I think I’ll bunk classes today, didn’t sleep well last night. Got about... Oh! Two and a half years of sleep to catch up on.” He joked. I smiled back trying to wipe off the disturbing reflection off my mind. I ignored it as some leftover figment of a nightmare. But the nightmare wasn’t over.\n\n***\n\nIt was hot at college. By the time I stepped out of the lift on 5000 series, I was soaked in sweat. But that’s partly because the lift didn’t go straight to my floor. I was the only one on the lift and I remember pressing ‘4’, but it took me to the 7th floor. I didn’t even notice anything until it was too late. I stepped out of the lift and turned right and then left as usual. I came upon a wooden door that wasn’t supposed to be there. That’s when I realized that I was on the wrong floor. I went back to the lift and pressed the down button.\n\nI waited for one minute... two... five minutes. It didn’t come. The thing was broken, I thought, or someone might have messed with the buttons. I thought of using the stairs. But just out of curiosity, I went back to that door. It was colored red with a glass pane. Inside, three men in white lab coats were arguing among themselves. I could hear them talking.\n\n“I don’t care how it happened, you just need to fix it.”\n\n“We’re all trying to fix it. Even otherwise we’re all screwed.\n\n“At least I’ve done my part. The broadcast has been sent...” That’s when he saw me. “Hey! You’re not supposed to be here.”\n\nI shrugged, “The lift is broken. I’ll just be going. I guess I need to use the stairs.” Just then I heard a loud ding, louder than normal, the sound of the lift. “I guess it’s working after all,” I continued and rushed out of there. Those people were making me nervous. I got into the lift, pressed the ‘4’ button four times, and finally came to the correct floor.\n\nIt was even hotter on this floor, I realized. I tried to look up the temperature on my phone, but it just showed a bunch of random numbers. Even this wasn’t with me, so much for technology. Not thinking much about the incidents, I went to my class.\n\n“Good morning Sabiha!” Shivam greeted me. Sabiha was my sister’s name. I was Shekhar. I ignored his greetings assuming that he was just messing around with me.\n\n“Global warming is just killing us.” I said, “Have you seen how hot it is today?”\n\nShivam looked at me confused. “Where’s the heat? It’s cold today,” he said, pulling his jacket a little tighter. Wait... A jacket?\n\nI started to get dizzy again. I went out of the class and went into a lab two floors below. I took the stairs this time. I tried to switch on a computer, but it wouldn’t turn on. I tried a few more computers, not even one turned on.\n\nIt had to be 40 degrees today, at least. And there was a strange smell in the lab, that strange smell of burning fuel and grease you get on a bus. It appeared to me that I might be losing my mind today. Whatever it was, I realized that it’d be better for me to return to my hostel. I grabbed my bag, took the stairs and was out on the road. Outside, it was even hotter. And that smell was stronger.\n\nMaybe I’m having a stroke; the thoughts crossed my mind. My father had died in a stroke. But was I not too young to have a stroke? Ignoring the thoughts, I started walking home carefully. It was windy today, but the air was hot. I popped in my earphones and opened Gaana.\n\n“Honestly speaking,” a female voice came through the earphones, “we are not sure what is going on. Although reports are coming from everywhere, there’s no need for panicking. But it appears that we need to move some people from Situation 3 to Situation 5. Things are very fragile right...” Suddenly, Move On blasted through the speakers and the wind became cooler.\n\n***\n\nI was just getting dressed for the party when it happened. My laptop was switched off, but the lid was open. It turned on by itself, and some white text appeared on the black background: ‘We’re your friend.’ Then a voice came through the speakers.\n\n“If you are hearing this, you may be wondering what’s going on. Rest assured, nothing is wrong, it’s just a temporary bug and our engineers are working on it. Don’t worry if you see strange reflections.\n\n“Now, listen carefully. No matter what anyone says, do not feel afraid or distraught. Remember that We’re your friend. Without Us, you’ll find yourself in a very scary place. For the next few days you might find something out of place, but don’t worry, We’re here to protect you. So, if you hear anyone say otherwise, please report them. Just say Code ⊗⊗⊗, and we’ll listen. In a few days, things will go back to normal, and you’ll not remember seeing anything out of place.\n\n“Finally, since only a few people will receive this, please do not mention this to anyone. Thank you for understanding and being with us. Enjoy your day.”\n\nThe laptop turned off and I stood there in shock. I saw my reflection on the screen. Rather than the jeans and shirt, I was wearing, in the reflection, I was wearing a blue gown. I blinked, and when I looked again, I was back to my normal attire. I wondered if I should call home but decided not to. Maybe I was going crazy. I pulled myself together and went to the party.\n\n***\n\nNothing happened at the party. Sabiha cut the cake, we sang Happy Birthday to her and stuffed ourselves with pizza. I felt that everything was back to normal. After the party, I hugged Sabiha goodbye. But as I was hugging her, I happened to look into the pool. I expected to see clouds and trees, but instead, I saw white fluorescent lights hanging from an industrial ceiling. And at the edge of the pond was my head. Something was on my head, like a helmet.\n\nSomething told me that I needed to stay calm and not panic. I released Sabiha and thanked her for the party. Then still looking at my reflection, making sure not to blink, I grasped the helmet and pulled. Pain rushed through my head, wires were running through my nose and ears. My vision went black. But as I pulled, finally the helmet came loose. I looked at it, it was black with several wires dangling from it.\n\nI threw it at the pool. Only now there was no pool, but a gaping hole in the concrete floor. I turned to look for Sabiha. Even she had a helmet on her head. She looked very different from what I was used to, pale as a ghost with scars all over her body. I looked around; we’re in an enormous room, full of people in blue gowns and a helmet on their heads moving around like zombies. Among these people were several others in a white lab coat, like those I saw in my college. They didn’t have those helmets, they’re observing the people in the blue gown and taking notes. There was also a third group of people, dressed in military uniforms and armed, patrolling the area.\n\nI noticed that the blue gowns had hoods. I put it on my head so that no one will notice that I didn’t have a helmet. I looked at Sabiha, her eyes were empty. “Hey! Wanna get out for a walk?” I asked her. “It’ll be great.”\n\n“Sure,” she said.\n\nI saw two doors in the room. I choose the one further way but with fewer guards. As I led Sabiha quietly out of the door, I saw two of the guards drag in a woman through the other door. She was in a blue gown and didn’t have a helmet on her head. Her face was bloodied and she was screaming, “You need to wake up. They’re not your friend, They’re using you. Find a mirror, look at your reflection. You have...” One of the guards smashed her head with a stick. The other guard dragged and dropped her body in the hole at the center of the room.\n\nWe went out of the room and kept walking. We went down hallways, unsure of our destination. I saw more rooms along the hallways, each with a door with a glass pane. Inside each room were more people like us. It seemed as if we’re walking for hours. Finally, I found a small room, like a storage room. We went inside and locked the door. This is where we’re now. I haven’t removed the helmet from Sabiha’s head, for two reasons. First, I think the reality might be too terrifying for her.\n\nSecondly, I’ve got a plan. If you’re reading this, that means the plan has succeeded. Sabiha believes that we’re now in her room. I’m dictating this complete make-believe story to her and she’s typing it on her phone. When it’s done, she’ll try to post it on my YourQuote profile, and I hope that this gets posted. I just hope that this reaches you.\n\nRemember that They’re not your friends. I don’t know what They’re, or what They do, and if everyone lives in this simulation. But if you can read this, know that They’ve got a lot of prisoners. You might be one of them and not even know it. Please find a way out and work on destroying Them.\n\n\n\n\n\nI originally wrote this for my college magazine. Adapted it for YourQuote.\n#reflection #scifishortstory #control #virtualworld #simulation #matrix #seethrough #reality","f":"i","l":["hor","lon"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/reflection-3n4d7","p":"3lytb","n":"3qdve"}