{"d":"2023-06-13T09:52:11Z","t":"As I anxiously awaited the arrival of the police, my eyes wandered around the room, searching for anything that could shed light on the mysterious events unfolding around me. Among the scattered notes and photographs, I spotted a worn diary tucked away among the papers. Curiosity aroused, I carefully picked it up, noticing the name \"Dr. Cooke\" carefully written on the front cover. I couldn't resist the urge to go through its contents.\n\n                                                                 cont...","c":"Flipping through the diary, a chill ran down my spine. Every detail about my life was carefully documented within its pages. It was as if the diary held a record of my every move, every thought, and every secret I thought was hidden away. Dr. Cooke seemed to have an intimate knowledge of my life, the notes resembling that of a psychiatrist, with observations and interpretations that delved deep into my psyche. It felt as if someone had been silently studying me from the shadows.\n\nWith the sound of police arriving outside, I swiftly tucked the diary inside my shirt, hoping to keep its contents hidden. Taking a deep breath, I attempted to compose myself before answering the officers' questions. Opening the door, I was met with a stern gaze and a blast of inquiries.\n\nThe police questioned me about my relationship with the neighbor, the missing girl, and any knowledge I had of her mysterious disappearance. Desperation fueled my response as I maintained my innocence, insisting that my interactions with the neighbor were limited to caring for her cat. Feigning surprise when they mentioned the hidden door, I claimed that I had only noticed strange shadows today, prompting my curiosity to investigate further.\n\nThe police officers scrutinized my words, their eyes scanning my face for signs of deception. My anxiety grew with every passing second. However, I maintained my composure and answered their questions to the best of my ability. Finally, after what felt like an eternity, they seemed satisfied with my responses, albeit with a lingering hint of skepticism.\n\nConcluding their questioning, the police sternly warned me to stay available for future inquiries and let me go. Returning to my own house, the faint murmurs of the police outside still reached my ears, reminding me that their investigation was far from over. Retreating to a secluded corner, away from prying eyes, I couldn't shake the feeling that I needed to be cautious.\n\nMy mind raced, struggling with the implications of the diary I had discovered. How was it possible for someone to possess such intimate knowledge of my life? Who was Dr. Cooke, and how did they know so much about me? What was their connection to the missing girl and her disappearance?\n\n\n\n#fragments_by_sd #diary #secret #stalking\n\nWelcome to the day 15 of #YoStoWriMo or the YourQuote Story Writing Month i.e. May. \n\nCollab and write a #shortstory titled #doiknowyou. Post longer stories in the caption. No word limit. No language bar. Post in any language. #YourQuoteAndMine\nCollaborating with YourQuote Baba    ","f":"i","m":[[2551,2565]],"l":["sto","dia"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/i-anxiously-awaited-arrival-police-my-eyes-wandered-around-i-creiwk","p":"crd7je","n":"creswf"}