{"d":"2024-01-31T15:47:42Z","t":"Detour 1\n\n\n“Let's visit Pirathukulam in the upcoming holidays, okay?” Tanisha suggested. She was standing behind me, her hands resting on my shoulders.\n\nI was busy with my work from home that day. It seemed like Tanisha had a day off. “What? Which holiday?” I asked, turning around in surprise.\n                                                          ...","c":"#detour_by_sd\n\n“Let's visit Pirathukulam in the upcoming holidays, okay?” Tanisha suggested. She was standing behind me, her hands resting on my shoulders.\n\nI was busy with my work from home that day. It seemed like Tanisha had a day off. “What? Which holiday?” I asked, turning around in surprise.\n\n“You seem to have forgotten,” Tanisha began, “Kannada Rajyotsava is on a Monday this year. The next day is Deepavali. Bhaidooj is on Friday. If you take leave for the two days in between and add the weekends, you get a long holiday.” It seemed like Tanisha knew more about my company's holidays than I did.\n\n“But if I get such a long break, wouldn't I prefer to go home?” I suggested.\n\n“Nah, you wouldn't go home for just a week,” Tanisha reasoned. She was right. I lived quite far away, so whenever I went home, it was for at least three weeks.\n\n“You seem to know everything about me,” I remarked. Tanisha smiled. A dimple appeared on her cheek, making her look even more beautiful.\n\n“So, what's this Parikulam you're talking about?” I asked, intrigued.\n\n“No, it's Pirathukulam,” Tanisha corrected me, feigning annoyance. “It's a quaint village in Tamil Nadu. That's where my grandmother was born. I've only been there twice. The first time, I was just a year old, so I don't remember anything. My parents told me about it. The second time was when I was in school. It's a serene place, far from the city's hustle and bustle. You'll appreciate its tranquility.” She said, her eyes sparkling with nostalgia. Tanisha always seemed to get poetic while talking about these things.\n\nSo, it was settled. Tanisha would handle the arrangements. She knew more about this part of India than I did. All I had to do was follow her lead, which I was more than willing to do. We still had two weeks until the holidays, but Tanisha's excitement made it feel like they were just two days away. She was returning there after a long time, and now that she had a job, she wanted to bring gifts for all her uncles, cousins, and their children. I accompanied her on these shopping trips, not minding it at all. Seeing her so full of life made me happy.\n\nPirathukulam, as it turned out, was a significant state in ancient times, ruled by kings. Over time, the kings lost their power, and the state was divided into smaller parts, each owned by different landowners. Now, those divisions were gone too, and it was just a small part of India, under government rule. Tanisha's ancestors were one of those landowners. They didn't have any power now, but people still respected them. Tanisha's grandmother had married and moved to the city, and that's where her parents and Tanisha herself were born.\n\nOn the night of the 29th, we got on the train at Bangalore City Junction, heading for Madurai. The journey was quiet and uneventful. It was already late, and most of the passengers were getting ready to sleep. I've noticed that people tend to go to bed early when they're on a train.\n\nWe both had upper berths. We climbed up and lay down, chatting and giggling, not really caring about the grumpy 'shushes' coming from below. Finally, an old uncle from one of the lower berths asked us to be quiet. We found this funny, but decided to respect the other passengers' need for rest.\n\nSo, we switched to messaging each other on Whatsapp, even though we were lying side by side. This was amusing too. But soon, we decided to call it a night. We had to wake up early the next day, after all. The adventure was just beginning.\n\nThe next morning, we woke up early to the sound of voices from the other passengers below. Ironically, it was the same old uncle who had asked us to be quiet the night before. He was now making a fuss, scolding a boy in their group for spilling tea on his pants. We didn't climb down from our berths, but instead bought tea from a vendor who was passing by.\n\nThe train was running a couple of hours late, but we knew we would reach Madurai soon. We decided to stay in our berths until we were closer to our destination. When the train finally pulled into Madurai Junction, we gathered our belongings and stepped onto the busy platform.\n\nAccording to Tanisha, the next part of our journey would be by bus. We left the station and took a taxi to the bus stand. The next bus wasn't due for another half an hour, so we decided to have breakfast at a nearby hotel. Tanisha ordered Idlis. I ate them too, albeit reluctantly, as I wasn't particularly fond of South Indian cuisine.\n\nWhen we first got on the bus, it was pretty empty. But as we continued on our journey, more and more people got on, and it became quite crowded. The weather was hot, and even though I was sitting by the window, the slow pace of the ride and the crowd made me sweat. I tried to distract myself by looking out at the city passing by.\n\nI had suggested to Tanisha that we explore Madurai before we left, but she pointed out that we were already running late and didn't want to delay our journey any further. The bus ride was smooth at first, while we were still in the city. But once we started to move out of the city, the condition of the road deteriorated significantly.\n\nThere were so many potholes that the bus swayed and jolted a lot. It was so bad that I joked to Tanisha that if I had moved this much in my school sports, I would have won the first prize.\n\nThe bus came to a halt at its final stop, and all the passengers disembarked. Tanisha looked worried as she went to speak with the conductor. When she returned, she explained the situation to me. The bus was supposed to go further, but there was a problem. There was a river nearby with a bridge that had been destroyed in a flood the previous year. The government hadn't had time to rebuilt it yet. There was another bridge, but it was quite far and required a detour. The buses used to take that route, but they had recently decided it wasn't worth the extra time and distance.\n\nOur options were to take another bus that would go the long way around, or to take a boat across the river. I looked at the road and then back at Tanisha. “No more buses for me,” I said. “I've learned my lesson.” I hadn't expected this journey to be so full of changes and challenges. Back in Bangalore, I would have simply booked a cab to get where I needed to go.\n\nWe made our way to the nearby dock. Tanisha pointed out the remnants of the destroyed bridge in the distance. A small wooden boat was waiting at the dock, ready to take passengers across the river. This was my first time getting on a boat, and I was a mix of excitement and nerves.\n\nAs I stepped onto the boat, it swayed slightly, causing me to lose my balance. A small shriek escaped my lips, much to Tanisha's amusement. Despite the shaky start, we managed to get on the boat and find a spot on a wooden plank to sit. There were about ten other people already on board, and we joined them as the boat pushed off from the dock.\n\nI found myself sitting next to a woman and her child. The woman asked me in Tamil, “Where are you going?” Thanks to Tanisha, I had a decent understanding of the language and was able to respond casually, “Pirathukulam.”\n\nSuddenly, the atmosphere in the boat shifted. It was as if a chill had swept over the passengers. Their faces turned pale, and a sense of unease filled the air. A man sitting across from me said, “You shouldn't go to Pirathukulam.”\n\n\nTo be continued...\n\n\n\nBackground created with Dall-E.\n\n#travel #romance #adventure #suspense #journey #holiday #mystery","f":"i","l":["trl","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/detour-1-let-s-visit-pirathukulam-upcoming-holidays-okay-she-cs6d7x","p":"cs4jzr","n":"cs7aur"}