{"d":"2024-02-03T20:15:30Z","t":"Detour 2\n...\nSuddenly, the atmosphere in the boat shifted. It was as if a chill had swept over the passengers. Their faces turned pale, and a sense of unease filled the air. A man sitting across from me said, “You shouldn't go to Pirathukulam.”\n\nI turned to the man, my eyes wide with surprise and worry. Tanisha looked at him too, her eyebrows furrowed in confusion. “What's the matter with Pirathukulam?” she asked. She was much better at Tamil than me.","c":"#detour_by_sd\n\nI turned to the man, my eyes wide with surprise and worry. Tanisha looked at him too, her eyebrows furrowed in confusion. “What's the matter with Pirathukulam?” she asked. She was much better at Tamil than me.\n\nThe man replied, “It's not safe to visit Pirathukulam at this time of the year. It's dangerous. You could lose your life if you go there.” His words sent a chill down my spine.\n\n“But why?” Tanisha questioned, her voice filled with concern. I stayed silent, just listening to their exchange, not adding anything from my side.\n\n“People get killed there,” the man responded tersely, refusing to provide any further details.\n\nTanisha turned to me and spoke in English, probably so that the others wouldn't understand. “They might just be pulling our leg because we're newcomers, or they might believe in some superstition. There's nothing strange about that place, or I would have heard about it.” Her reasoning was somewhat comforting, but I was still a bit on edge due to the grim humor of the locals.\n\nI decided to focus on the positive - my first boat ride. I tried to enjoy the gentle sway of the boat and the cool breeze. I could see the other side of the river bank approaching. It was a sight to behold, and for a moment, it helped me forget about the unsettling conversation.\n\nWe got off the boat and handed the fare to the boatman. He nodded and thanked us, then rowed away. I checked my watch and saw that it was already past 12. We had been travelling for a long time. I wondered how much longer it would take to reach our destination.\n\nTanisha told me not to worry. She had already called her relatives and arranged for a car to pick us up from the bus stand, which was not far from the river bank. We walked for a few minutes and reached the bus stand. There was a jeep parked there, with a young man leaning against it, probably in his mid-twenties. He smiled when he saw us and waved. Tanisha ran towards him and hugged him. She introduced him as her cousin, Adithan. He greeted me warmly and shook my hand. He seemed genuinely happy to meet us.\n\n“I just got here,” Adithan said. “I didn't know the buses have stopped going the long way around, or I would have told you earlier.” His words made me feel a bit better. It was nice to know that we were among friends, but I still wondered what the man on the boat had meant by his ominous words.\n\nWe climbed into the jeep and it started moving. Tanisha began to explain to me that there weren't many public transport to Pirathukulam. Most people just walked to this bus stand, which was the closest one. Those who had their own vehicles, used them. As we drove along, Tanisha and Adithan were deep in conversation, sharing stories and catching up. I didn't join in much, just nodding and saying “yes” every now and then. I was more focused on the road and the scenery outside.\n\nAt one point, Adithan turned to Tanisha and asked how we had met. I felt a bit embarrassed and didn't know what to say. But Tanisha quickly said that she would tell the story later, when everyone was together. I felt a wave of relief wash over me. I could deal with the embarrassment later.\n\nThe road we were on was mostly paved, but it was far from perfect. There were potholes scattered here and there, making the ride a bit bumpy. The road twisted and turned, winding its way through the countryside. Sometimes, it felt like we were going in circles, heading back the way we came. But despite the condition of the road, the jeep ride was much smoother than the bus ride.\n\nAdithan chuckled and said, “You know, they'll fix this road before the next election, but it'll break down again just a few days later.” His comment made me smile. It seemed like some things were the same no matter where you went.\n\nAs we drove, I looked out the window at the scenery passing by. There were farm fields on both sides of the road, stretching out as far as the eye could see. Tall electric poles stood sentinel among the fields, their wires crisscrossing above us. Every now and then, we would pass a small pond or puddle, its surface covered with a layer of algae and water hyacinths. A few of them had ducks paddling around and dragonflies hovering over the water surface.\n\nA few mud houses dotted the landscape, adding to the rustic charm of the place. Smoke could be seen, indicating that lunch was being prepared. Occasionally, we would pass a group of cows lazily grazing in the fields, or a farmer working hard under the sun. The road was lined with trees, providing a much-needed respite from the harsh sun.\n\nThe paved road we were on had now turned into a dirt path. “We're almost there,” Adithan said, breaking the silence. “Pirathukulam is just beyond that lake.” He pointed ahead, where I could see a large expanse of dry land. It looked like a lake that had been drained of water, leaving behind a cracked and barren surface.\n\nAs we got closer to the lake, I noticed that one side of it was bordered by a thick forest. It looked like a jungle, with tall trees and dense foliage. A narrow road branched off from the main road and led into the forest. Adithan followed my gaze and said, “That road goes to an ancient temple. It's very old and sacred. Maybe we can visit it sometime, if you're interested.” I nodded, curious about the temple.\n\nAdithan added, “There's also a tribe that lives in the forest. They're called the Koligarus. They're very friendly and hospitable. They have their own culture and traditions, and they're very close to nature. They sometimes come to the village to trade or get supplies.”\n\nAs we approached the lake, a half-broken bamboo bridge came into view. It was a stark reminder of the lake's past when it was full of water. Now, it was dry, with tire marks crisscrossing the parched lake bed. Adithan steered the jeep onto the lake bed, following the tracks left by previous vehicles.\n\n“You know,” Adithan began, his eyes focused on the path ahead, “my forefathers used to tell stories about this lake. They said it was full of water once. But now, as you can see, it's all dried up. People just drive or walk across it these days.”\n\n“But when the rainy season comes,” Adithan continued, “the lake fills up again. That's when the bamboo bridge comes into play. People repair it and use it to cross the lake. The bigger vehicles, they have to take the long way around.”\n\nOnce we crossed the lake, the road veered away from the jungle. “Welcome to Pirathukulam,” Adithan announced as we entered the village. It was more developed than I had imagined. There were several shops lining the streets and a few buildings that stood out among the traditional houses.\n\nAdithan pointed out the landmarks as we drove through the village. “That's the government school over there,” he said, pointing to a large building. “And that smaller one is a private school. We also have a government hospital.” I was pleasantly surprised to hear that the village had such amenities.\n\nAs we drove further, I noticed that the village was buzzing with activity. People were returning from the fields, their heads laden with bundles of hay and firewood. Some were herding their cattle back home. “Pirathukulam may not be a city, but we have everything we need here,” Adithan said, a note of pride in his voice. “We even have electricity and network connectivity.” I smiled at his words. Despite its rural setting, Pirathukulam was keeping up with the times.\n\nAfter driving through the village, the jeep slowed down and turned into a large courtyard. I gasped as I saw the house that stood beyond it. It was a big house, almost like a palace, with a grand facade and a tiled roof. It looked old and majestic, but also quite broken in some places. The walls were cracked and the paint was peeling off. The house extended to two more sides of the courtyard, forming a U-shape. There were a few trees and plants in the courtyard, but they looked neglected and overgrown.\n\nTanisha's ancestors were landowners of large estates. The grandeur of the house was a testament to their past status. Even though they had lost their land once the system was abolished, the remnants of their status were still visible in the grand house and the large courtyard.\n\nWe stepped out of the jeep and were immediately greeted by a very old lady. She was the oldest member of the family, I was told later. Behind her, a group of children were giggling and whispering among themselves. More family members, both young and old, were standing further back, all of them smiling warmly at us. It was a big family, spanning four generations, all living together under one roof. It was a heartwarming sight.\n\nMany of the family members had moved to cities for work or studies, but many still remained in the village. And those who had moved away would always return to visit. It was clear that the bonds of this family were strong and deep.\n\nTwo of Tanisha's cousins came forward and took our bags from us. They led us to a large drawing room. The inside of the house was in much better condition than the outside. The walls were freshly painted and the furniture was well-maintained.\n\nA lady in her mid-50s, still quite beautiful, served us a pale brown drink. It was sweet and tangy, with a hint of lime, and very refreshing. We were told to freshen up and join the family for lunch. Everyone had been waiting for our arrival to start the meal. I was then shown to the guest room, where I could freshen up.\n\nAfter taking a bath, I joined the family in the courtyard for lunch. Everyone was sitting on the ground, forming a circle. Tanisha's aunt, the lady in her 50s, came up to me and asked, “Do you have any problem sitting on the floor?” I shook my head and said, “No, it's okay. I don't mind.”\n\nShe smiled and said, “Good. Come, sit with us.” She led me to a spot next to Tanisha. We were given banana leaves to eat on. The younger women of the house began serving us, starting with a mound of rice on our banana leaves.\n\nWhat surprised me was that while everyone else was served the same dish, they had prepared different ones for me, typical of North Indian dishes. There was dal, paneer, and roti. I looked at Tanisha, surprised and confused. She seemed to read my mind and said, “I know you're not fond of South Indian food, so I asked my aunt to prepare something different for you. I hope you like it.”\n\nI felt a pang of guilt. “That wasn't necessary,” I said. “I would have been okay with what everyone else was having.” But Tanisha just laughed and told me to enjoy the meal. It was clear that this family went out of their way to make their guests feel comfortable. And I was starting to feel very much at home.\n\nAfter we finished our meal, everyone started to disperse. Tanisha got up and went to chat with her cousins and aunts. I was told to rest, but by that time, the children of the house had already gathered around me. I had always been good with kids, or so I had been told.\n\nTheir parents tried to call them away, explaining that I needed to rest. But the kids didn't want to leave, and honestly, I didn't mind their company. We settled down in the drawing room, chatting about all sorts of things. I told them stories, shared silly jokes, and even showed them a few simple magic tricks. Their laughter filled the room, making the atmosphere light and joyful.\n\nAs the evening approached, the other members of the family started to join us in the drawing room. Tanisha came back too. Snacks were served, and everyone enjoyed the light bites. Then, Tanisha brought out all the gifts she had bought for the family. She started handing them out, and everyone began to admire the beautiful items she had chosen.\n\nHowever, amidst all this, I felt a bit sad. Since we had arrived, I hadn't really had a chance to talk to Tanisha. I tried to distract myself by focusing on the children, even pulling out my phone to watch cartoons with them.\n\nBefore we knew it, the day had come to an end. The call for dinner echoed through the house. “People here have a routine. They eat early, sleep early, and wake up early,” Tanisha explained. I had eaten lunch late, so I wasn't really hungry. After a bit of gentle persuasion, they agreed to give me some dry snacks, just in case I got hungry later.\n\nAfter dinner, the children announced that they wanted to stay up all night, talking with me. The elders quickly agreed, knowing well that the kids wouldn't be able to stay awake for long. We moved to a large bedroom. Tanisha was going to sleep with her cousins. I sat in the middle of the kids, continuing our playful banter. But soon, the younger ones started to doze off.\n\nSeeing this, we all agreed that it was time to sleep. I gently picked up the sleeping kids and tucked them into their beds. Exhausted from the long journey, I too decided to call it a night. As soon as my head hit the pillow, I fell asleep.\n\nI was jolted awake in the middle of the night. The room was pitch black, and the only sound was the distant chirping of crickets. I felt hot, especially under the mosquito net. The ceiling fan was still, indicating a power cut. I got up from my bed and walked over to the window. It was shut. I opened it, and a cool breeze swept into the room, providing some relief from the heat.\n\nThe thin crescent of the waning moon didn't provide much light, but my eyes had adjusted to the darkness. I could make out the silhouette of the forest in the distance. This room was at the back of the house, offering a clear view of the wilderness beyond. I stood there for a while, enjoying the quiet and the cool breeze.\n\nSuddenly, the wind stopped. The crickets fell silent. The silence was almost eerie. And then, breaking the silence, came a loud, blood-curdling scream from the direction of the forest. It was a chilling sound, a mix of a shrill cry and a guttural growl. It was hard to describe, but it sent a shiver down my spine. I stood there, frozen, as the echo of the scream faded into the night.\n\n\n\nTo be continued...\n\n\n#mystery #culture #family #journey #suspense #hospitality #ominous","f":"i","l":["trl","hor"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/detour-2-suddenly-atmosphere-boat-shifted-it-chill-had-swept-cs7aur","p":"cs6d7x","n":"cs746u"}