{"d":"2023-10-17T09:12:38Z","t":"\n\n\n\nThe world around me blurs as I stumble out of the machine, my knees buckling under the sudden weight of reality. The air is thick with smoke, the acrid scent of burnt wires stinging my nostrils. The once pristine lab is now a scene of chaos, the side of the machine charred and smoking.\n\n                                                    cont...","c":"Behind me, Edna coughs, her voice barely audible over the whirring of the machine. I crawl back to her through the clearing smoke, my hands finding hers in the dim light. Her touch on my arms feels familiar, a comforting anchor in the midst of turmoil.\n\nI guide Edna to a chair, her body slumping against mine. She looks up at me, her eyes tired but filled with a sense of accomplishment. “You got it working,” she whispers before her body goes limp in my arms. A sob catches in my throat as I cradle her lifeless form, the reality of our situation sinking in.\n\n“I'll go back and make things right,” I promise her silently. I have to change the timeline to fix my mistake. With renewed determination, I quickly fix the burnt wires and enter the machine.\n\nThe door shuts behind me with a soft click, and I press the button to initiate the time jump. Through the porthole, I watch as the flux capacitor starts charging. It sparks to life and suddenly, I'm sent hurtling through time.\n\nMy stomach drops as a horrifying sight greets me - thousands of dead Ednas sitting in thousands of chairs scattered throughout the time field. “No,” I scream, my voice echoing through the void. How many times have I held her as she died? How many times have I failed?\n\n“I have to remember,” I remind myself, but then everything turns black.\n\n\nThe world around me blurs as I stumble out of the machine, my knees buckling under the sudden weight of reality. Was I supposed to remember something? No, everything is perfect. The lab is pristine, just as it was before my test run. It must be exhaustion playing tricks on me; after all, these last few months leading up to today have been gruelling.\n\n“Is it ready?” Edna's voice pulls me from my thoughts. She's standing there with an expectant look on her face. Edna is my lab assistant and over time, she's become more than that - she's become someone special to me.\n\n“Yes, it is,” I reply curtly, too excited to elaborate further. Today is the day we've been waiting for - today we test our working prototype. After this first trip, once we've made history, I'll finally tell Edna how I feel about her.\n\nWe step inside and hold each other close as the flux capacitor starts charging. “I can't believe it,” Edna says in awe, “The first working time machine.” The capacitor sparks and suddenly everything turns black.\n\n\nThe world around me blurs as I stumble out of the machine, my knees buckling under the sudden weight of reality. The air is thick with smoke, the acrid scent of burnt wires stinging my nostrils. The once pristine lab is now a scene of chaos, the side of the time machine charred and smoking.\n(go back and read the story again :)\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 5 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\nI backspace through time to save what I've #lost. #timetravel #memoryloss\nToday, write a #shortstory titled Backspace. Language no bar. Feel free to extend the story in the caption of your posts. #backspaceashortstory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[3042,3056]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/world-around-me-blurs-i-stumble-out-machine-my-knees-under-csenxy","p":"cseftc","n":"csfo0s"}