{"d":"2023-10-22T10:29:51Z","t":"In the bustling heart of Mumbai, where dreams collided and danced in the neon lights, two souls found a love that defied the city's chaotic rhythm. Haardik and Garima, amidst the chaos of life in the city, discovered a love so profound that it felt like destiny itself had woven their stories together.\n\n\n                                                          cont...","c":"Their story began on a humid monsoon evening, under the sprawling canopy of Marine Drive. The streetlights glittered like stars, mirroring the dreams that sparkled in their eyes as they shared their first conversation. Garima, with her enchanting smile, and Haardik, with his charismatic charm, would quickly find themselves falling deeply in love.\n\nTheir paths had serendipitously crossed that evening, brought together by a shared interest in the monumental launch of Chandrayaan 1. As they exchanged enthusiastic thoughts and speculations about the mission, their connection deepened, and they soon realized that their mutual passion for space and exploration was the force that bound their hearts.\n\nIt had been just a month, and their love for each other was stronger than ever. They would spend countless hours wandering through the city's diverse neighborhoods, from the vibrant markets of Colaba to the enchanting tranquility of the Hanging Gardens. In the bustling chaos of Mumbai, they had found their peaceful sanctuary in each other's arms.\n\nHowever, their love faced a formidable obstacle. Garima belonged to a conservative Marathi family, while Haardik was a Punjabi from Delhi. Their parents had different expectations and traditions for their children's marriages. The two families couldn't look beyond the societal boundaries that separated them, and their love was branded as forbidden. They tried to arrange marriages for them with suitable partners from their own communities.\n\nFrustration and desperation gnawed at Haardik and Garima. They realized that if they wanted to be together, they had to take matters into their own hands. So, they made a daring plan to elope on a night of late November, hoping that the day would mark the beginning of their free and loving life together.\n\nHaardik purchased two train tickets to a remote town in the Western Ghats where they could start anew. He arranged for a secret rendezvous at the railway station, a place teeming with people, where they hoped to lose themselves in the crowd and begin their journey to a new life.\n\nThe night was thick with anticipation as they whispered loving promises on the phone. Haardik, filled with both excitement and nervousness, waited anxiously at the station, the weight of their shared dreams resting heavily on his shoulders. He watched the clock's minute hand move slowly, the seconds ticking away as he scanned the sea of faces, searching for the one that meant the world to him.\n\nAs the clock struck nine, Garima stood at the precipice of her fateful decision. She stood in her bedroom, dressed in her favorite red saree, ready to leave her old life behind. Her phone was clutched in her hand, her heart pounding. She gazed at a picture of her parents, torn between her love for Haardik and her respect for her family. She realized that running away would not only break her parents' hearts but also her own.\n\nIn a trembling voice, Garima called Haardik. “Haardik, I'm sorry, I can't do this,” she said.\n\n“What? What do you mean?” he asked.\n\n“I can't run away with you. I can't hurt my parents like this. They have done so much for me. They will never forgive me.” Tears welled in her eyes as she told him she couldn't go against her family's wishes.\n\n“Garima, please don't say that. We love each other. We can't let our parents decide our fate. They will understand eventually. Please come, we have to go now.”\n\n“No, Haardik, I'm sorry. I can't go with you. Please forgive me.”\n\n“Garima, how can you do this to me? How can you break my heart like this? You are the only one I want. Please don't leave me.” Haardik felt his world crumbling. He couldn't understand how love could so suddenly turn into betrayal.\n\nAmid their heated exchange, Garima heard a sudden commotion on Haardik's end of the line. There was a cacophony of raised voices, and then, the chilling sound of gunshots pierced the air. Garima's heart raced as she cried out, “Haardik! Haardik!” but there was no response.\n\nGarima's heart pounded, fear gripping her in an icy vice. She tried calling Haardik again and again, but he didn't pick up. Panic set in as she feared the worst. With trembling hands, she rushed to her balcony and looked out. The night was punctuated by the sound of sirens, and the chaos of the city continued around her, oblivious to the turmoil in her heart.\n\nGarima clung to her phone, tears streaming down her face, as she prayed for Haardik's safety. The future that lay before her was uncertain, and all she could do was hope and pray for Haardik's safety, as the haunting echoes of those gunshots reverberated in her mind.\n\n\n\nDisclaimer: Any resemblance to actual persons, living or dead, is purely coincidental. However, some similarity to real events may be intentional.\n\n\n#continuity_by_sd\n\nWelcome to the Day 7 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#love #forbidden #mumbaiattack\nImagine you're in the city that never sleeps. What do you do? Collab and complete this #shortstory. Feel free to extend the story in the caption of your posts. #citythatneversleeps #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[5128,5142]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/bustling-heart-mumbai-where-dreams-collided-danced-neon-two-csfwo7","p":"csfo0s","n":"csf3zw"}