{"d":"2023-11-01T15:18:25Z","t":"“Where are you?” The phone on the car dashboard lit up, illuminating the dark interior. Xavier's hands gripped the steering wheel as he glanced at the message. There was no name for the sender, but the string of heart emojis made it clear who it was from. The message sent a surge of emotions through Xavier, like a mix of hope and anguish.\n                                                          cont...","c":"“I'll be late tonight, honey. Don't wait up,” Xavier replied, his fingers trembling slightly as he typed out the response. He set the phone down on the passenger seat, its soft glow casting eerie shadows across the car's interior.\n\nFive months ago, Xavier had met Yasmin at a dimly lit bar. She was the most beautiful girl he had ever seen, and he had fallen in love with her instantly. With a mix of courage and the help of a few drinks, he had approached her, offering to buy her a drink, and their conversation had flowed naturally. Yasmin, too, had felt an immediate connection, and their whirlwind romance had begun.\n\nYasmin was undeniably enchanting, but she came with her demands and eccentricities. Xavier, however, loved her unconditionally, willing to overlook any flaws. So when Yasmin had suddenly broken up with him a week ago, it had shattered his heart. Her explanation was as abrupt and cold as the message that had just lit up on his dashboard: \"It's not you, it's me,\" sent through a text message. There hadn't been a phone call or a face-to-face meeting, just a heartbreaking message.\n\nXavier had been a jumble of emotions-sadness, anger, confusion. He couldn't accept the way things had ended. Yasmin had a routine, and Xavier had obsessively tracked it in the hopes of running into her. It wasn't easy, but tonight had finally offered him the opportunity he'd been waiting for. He had tailed her discreetly, watching her every move, and now she was unconscious in the backseat of his car.\n\nYasmin groaned as she slowly regained consciousness, her eyes widening as she realized her predicament. Her hands were bound, and a piece of cloth was tied around her mouth, preventing her from speaking. Xavier had orchestrated this abduction with meticulous precision.\n\nXavier had taken her phone away, disabling her only lifeline to the outside world. He was grateful for the fingerprint lock on her modern smartphone; it had allowed him to unlock Yasmin's phone effortlessly while she was tied up.\n\nAs Xavier's car sped into the night, the road ahead shrouded in darkness, the once-hopeful heart emojis on the dashboard phone screen seemed like distant memories of a time when love had thrived between them. Somewhere in the city, Yasmin's new boyfriend, who wasn't as infatuated with her as Xavier had been, simply thought that Yasmin was working late.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 15 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#obsession #heartbreak #kidnap\nCollab and write a #shortstory titled The Message. Language no bar. Feel free to extend the story in the caption of your posts. #themessagestory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2691,2705]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/where-you-phone-car-dashboard-lit-up-illuminating-dark-s-no-csiil2","p":"csh5tv","n":"csjd7d"}