{"d":"2023-11-19T09:32:05Z","t":"Irene felt a chill as she sped through the dark forest roads. The strange phone call had left her mind in a whirl, an incident she couldn't make heads or tails of. It was like trying to solve a puzzle with half the pieces missing. She decided to take a drive to clear her head, hoping to find some answers or at least some peace. The quiet of the forest roads was a welcome change, a place where she could think without distractions.","c":"She was so lost in her thoughts that she barely noticed the flash of glowing eyes and brown fur in front of her car. She slammed on the brakes, but it was too late. She heard a loud thud as she hit the deer, and then another as her car skidded off the road and crashed into a tree. She felt a sharp pain in her chest, but she managed to unbuckle her seat belt and get out of the car. She looked at the wreck and saw that the front of her car was smashed, and smoke was rising from the engine. She reached for her phone, but there was no signal. She cursed under her breath. Everything was going wrong today.\n\nShe turned around and saw a trail of blood on the road, leading to the woods. She felt a pang of guilt for the deer, and wondered if it was still alive. She decided to follow the trail, hoping to find the deer and maybe help it. She used her phone's torch to light her way, and walked into the woods. It was pitch black, and the only sound was her own breathing. She followed the bloodstains, which became more and more sparse as she went deeper into the forest. She wondered if she was going the right way, or if she was just getting lost.\n\nThen she saw them. The glowing eyes of the deer, staring at her from behind a bush. She shone her phone's torch at it, and saw that it was lying on the ground, bleeding from its side. It looked at her with a mix of fear and anger. The deer got up and charged at her, with a speed and strength that defied its injury. Irene was too shocked to react, and before she could dodge or scream, the deer rammed its antlers into her head, knocking her unconscious.\n\nShe didn't know how much time had passed when she woke up. It was still dark, and she felt a throbbing pain in her head. She tried to move, but she felt something was wrong. She looked at her hands, and saw that they were not hands at all. They were hooves. She felt her face, and felt antlers on her head. She was a deer? She panicked, and tried to make sense of what had happened. She remembered the phone call, the car crash, the deer attack. Was this some kind of curse? A punishment? She had no idea, but she knew she had to get out of there. She got up and ran, hoping to find a way back to civilization.\n\nShe didn't realize when she reached the road. She was so confused that she didn't see the headlights of the car coming towards her, her eyes reflecting the light. She heard the screech of brakes, and then a thud. She felt a familiar chill, and then nothing.\n\n\n\n#continuity_by_sd\n\nWelcome to the Day 26 of #YoStoWriMo or the YourQuote Story Writing Month i.e, October.\n#transformation #supernatural #accident\nCollab and write a #shortstory titled Encounter. Language no bar. Feel free to extend the story in the caption of your posts. #encountershortstory #YourQuoteAndMine\nCollaborating with YourQuote Baba","f":"i","m":[[2812,2826]],"l":["sto","mtl"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/irene-felt-chill-she-sped-through-dark-forest-roads-strange-csmtns","p":"csmo0n","n":"csnu93"}