{"d":"2023-12-25T19:13:49Z","t":"The Art of Deception 3\n\nEshan reached out, gently shaking Mahaira by her shoulder. “Mahaira, are you okay?” he asked, his voice filled with concern. Mahaira didn't reply, her gaze still fixed on Eshan, her mind a whirlwind of thoughts and emotions.\n\n                                                                       ...","c":"#the_art_of_deception\n\nEshan reached out, gently shaking Mahaira by her shoulder. “Mahaira, are you okay?” he asked, his voice filled with concern. Mahaira didn't reply, her gaze still fixed on Eshan, her mind a whirlwind of thoughts and emotions.\n\nEshan sighed, running a hand through his hair. “I know you're heartbroken, Mahaira,” he said, his voice soft. “And I'm sorry. I really am. But it's important. It's something I can't ignore.”\n\nEshan carefully placed the rectangular object on the bench next to them. With trembling hands, he began to unwrap the newspaper that covered it. Her heart pounded in her chest as she waited, her curiosity growing with each passing moment. When the wrapping was finally removed, Mahaira gasped. There before her lay a beautifully rendered portrait of herself, captured in oils on canvas.\n\nThe sight of the portrait triggered a flood of memories for Mahaira. She remembered a time when she and Eshan were dating. They used to sit by the lake, their legs dipped in the cool water, talking about everything and nothing. She remembered one such evening, her head resting on his shoulder, the setting sun casting a warm glow on their faces.\n\n“Eshan,” she had said, her voice barely above a whisper, “I'm getting married soon.” She had expected him to react, to show some sign of surprise or disappointment. But Eshan had simply nodded, his gaze fixed on the horizon.\n\nInstead, he had asked her a question that had taken her by surprise. “Mahaira,” he had said, turning to look at her, “Can I draw you? I have a chance at an exhibition and I want to put up your portrait.”\n\nEshan's voice pulled Mahaira back to the present. “Do you remember this picture, Mahaira?” he asked. Mahaira nodded, her eyes still fixed on the portrait. She remembered the day she had agreed without a second thought, feeling a sense of pride that Eshan wanted to use her portrait for his exhibition.\n\n“Yes, Eshan,” she finally said, her voice choked with emotion. “I remember. It was a year ago. You asked if you could draw me for your exhibition. I felt... I felt so lucky.”\n\nEshan continued, seemingly oblivious to Mahaira's emotional turmoil. “A while back, just as I was about to leave for the station, I received a call,” he said. “It was a buyer. He had seen your portrait at one of my exhibitions and wanted to buy it.”\n\nMahaira looked at Eshan, her surprise evident on her face. “Buy it? But why would...”\n\nEshan cut her off, raising a hand. “He said he was leaving town tonight and wanted to buy it right away. He was willing to pay a lot of money for it.”\n\nMahaira was silent, her mind racing. She looked at the portrait, then back at Eshan. She opened her mouth to speak, but no words came out. She simply nodded, her mind still trying to process the information.\n\nMahaira's thoughts were a whirlwind. She had always thought that the portrait was a gesture of love from Eshan. It was something special, a bond between them that transcended the ordinary. She remembered her initial reluctance at having her portrait displayed at the exhibition. But she had agreed, thinking that it would help Eshan, that it would boost his career.\n\nShe had never imagined that Eshan would sell the painting. It was their painting, a symbol of their love and connection. She told herself that Eshan had brought the painting to her as a gift, a token of his love. She clung to that belief, reassuring herself. Yes, that was right. Eshan loved her, and she loved him. The thought comforted her, providing a small measure of peace amidst the chaos of her emotions. She looked at Eshan, her eyes filled with a mix of confusion and hope.\n\nEshan broke the silence, his voice cutting through Mahaira's thoughts. “As I was saying, I can't leave with you today, Mahaira,” he said, his voice steady. “I have to make the delivery.”\n\nMahaira felt as if her world had fallen apart within the last few hours. Everything had gone wrong. She looked at Eshan, her eyes filled with a mix of confusion and despair. “But Eshan...” she began, her voice barely a whisper.\n\nEshan interrupted her, his voice gentle. “We'll try again another time, Mahaira,” he said, his eyes meeting hers.\n\nAfter what seemed like an eternity, Mahaira found the strength to speak. She pleaded with Eshan to go with her, to leave everything behind and start anew. “Please, Eshan,” she said, her voice trembling. “I can't go back. I've already left my husband.”\n\nEshan looked at her, his expression unreadable. “I can't just leave everything behind, Mahaira,” he said. “I have responsibilities. I have to make this delivery.”\n\nMahaira felt a drop of tear slide down her cheek. “But what about us?” she asked. “What about our love?”\n\nEshan sighed. “I can't just abandon my responsibilities. I have to think about my future.”\n\nMahaira's heart sank. “So you're selling the portrait?” she asked, her voice barely a whisper.\n\nEshan nodded. “Yes,” he said. “The money will help us in the future.”\n\nMahaira felt another tear slide down her cheek. “But it's our painting,” she said. “It's a symbol of our love.”\n\nEshan looked at her. “I know,” he said. “But I have to do what's best for me. You can go back to your husband, I'm sure he'll take you back.”\n\nMahaira shook her head. “I can't,” she said. “I won't. I love you, Eshan.”\n\nEshan looked at her for a long moment, then nodded. “I can't go with you, Mahaira. Not now.”\n\nMahaira slumped down on the bench, her body feeling heavy with despair. Eshan looked at her, his expression softening. “I understand your situation, Mahaira,” he said, his voice gentle. “But you should go home. It's getting late.”\n\nHe reached into his pocket and pulled out his phone. “I can call a cab for you,” he offered, looking at her with concern.\n\nMahaira shook her head, her voice firm despite the tears in her eyes. “No,” she said. “I can look after myself.”\n\nEshan nodded, putting his phone away. “Alright,” he said, standing up. “I have to go now. Take care, Mahaira.”\n\nWith that, he took the portrait and walked away, leaving Mahaira alone on the bench, her heart heavy with the weight of their conversation. She watched him go, her mind filled with thoughts of what could have been. But for now, she was alone. For now, all she could do was sit on the bench, lost in her thoughts, as the world continued to move around her.\n\nA train pulled into the station, its arrival stirring up a flurry of activity that jolted Mahaira out of her thoughts. She watched as passengers hurried to board, their faces a blur of anticipation and impatience. Among them, she noticed happy couples and families, laughing and chatting excitedly. They could have been one of those happy couples. She should have been on that train with Eshan, sharing in the excitement and anticipation. But instead, she was on a bench, out here.\n\nShe couldn't shake the feeling that something was off about Eshan's words. “I have to do what's best for me,” he had said. Why did he say “me” and not “us”? Had that slipped out of his mouth by mistake, or did he mean it?\n\nMahaira sighed, feeling more confused than ever. She knew she couldn't stay here forever, but she didn't know what to do. The thought of going back home filled her with dread. Arjun had probably already read the note she left. She wondered what he was doing now. Did he care? Was he sad? Did he miss her? The thought of facing him again filled her with a sense of dread.\n\nThe shrill sound of the train's whistle pierced the air, signaling its imminent departure. A rush of thoughts flooded Mahaira's mind. Should she run and get on the train, leaving everything behind? Or maybe she should just step in front of the train.\n\n\n\nTo be continued...\n\n\n#love #heartbreak #choices #regret #sacrifice #uncertainty #responsibility","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/art-deception-3-eshan-reached-out-gently-shaking-mahaira-you-csv1su","p":"csvryt","n":"cswpkx"}