{"d":"2023-12-28T10:11:18Z","t":"The Art of Deception 4 (end)\n\nAs the sun began to rise, the world around Mahaira started to come alive. A tea seller was setting up his shop in the corner of the station, the aroma of freshly brewed tea wafting through the air. Vegetable sellers were on their way on local trains, their baskets filled with fresh produce.\n\n                                                          ...","c":"#the_art_of_deception\n\nAs the sun began to rise, the world around Mahaira started to come alive. A tea seller was setting up his shop in the corner of the station, the aroma of freshly brewed tea wafting through the air. Vegetable sellers were on their way on local trains, their baskets filled with fresh produce.\n\nAfter hours of contemplation, Mahaira had finally made a decision. She was going to return home. She was going to face whatever would come her way. To her surprise, Eshan hadn't even called her to know if she reached home okay. She wasn't expecting that. She thought he cared more. And Arjun, he hadn't tried to call her either. She expected that. She knew he was probably still processing the note she left. She wondered what he was thinking, what he was feeling. But for now, she had to focus on herself. She had to face the consequences of her actions.\n\nThe morning bus was nearly empty, save for a few early risers. Mahaira found a window seat, her gaze fixed on the cityscape that was whizzing by. The buildings, the trees, the people - everything was a blur. It was as if the city was moving on, indifferent to her turmoil. Her tears had dried up, leaving a stinging sensation in her eyes.\n\nAs the bus trundled along, she watched as the city started to wake up. Shopkeepers were opening their stores, street vendors were setting up their stalls, and people were slowly trickling out onto the streets. Life was moving on, as it always did. And so would she. She had to. For the first time in what felt like forever, Mahaira felt a glimmer of hope. She didn't know what awaited her, but she was ready to face it.\n\nMahaira stood in front of the door, her heart pounding in her chest. This was her house, the one she had left behind. Could she still call it her home? She wasn't sure. With a deep breath, she reached out and pressed the doorbell. The sound echoed through the silent corridors, seeming to last an eternity.\n\nFinally, the door creaked open. It was Arjun. She hadn't expected to see him. In fact, she wasn't sure what she had expected. His presence was a surprise, but then again, anything would have surprised her at this point. She stood there, at the threshold, ready to face whatever came next. She had made some decisions, and now, it was time to face the consequences.\n\n“Mahaira, come in,” Arjun said, stepping aside to let her pass. His voice was calm, devoid of any accusation or question about her sudden departure. Mahaira nodded, her throat too tight to speak. She walked past him, her footsteps echoing in the silent house.\n\nShe made her way to her room, the familiarity of the surroundings both comforting and painful. Once inside, she closed the door behind her and slumped onto the bed. The tears she had been holding back came rushing out, her body shaking with the force of her sobs. She buried her face in the pillow, her cries muffled by the fabric.\n\nArjun's behavior had taken her by surprise. She had expected anger, questions, accusations... but he had offered none. His silence was unnerving, making her question her own actions. The guilt that she had been trying to suppress was now eating away at her, making her question every decision she had made.\n\nArjun knocked on the door lightly. “Mahaira, why don't you freshen up and come for breakfast?” he suggested, his voice gentle. Mahaira looked up, her eyes red and swollen from crying. She nodded, wiping her tears with the back of her hand. She got up from the bed and walked towards the bathroom.\n\nWhen she came out, she saw Arjun standing near the wall, a painting in his hands. He was carefully aligning it, his brows furrowed in concentration. Mahaira's heart skipped a beat as she recognized the painting. It was the same one that Eshan had shown her, the beautifully rendered portrait of herself.\n\nShe stood there, rooted to the spot, her eyes wide with surprise. “Arjun,” she exclaimed, her voice echoing through the silent room, filled with disbelief and wonder. “Where did you get that?”\n\nMahaira was taken aback. A whirlwind of thoughts swirled in her mind. How did Arjun get the painting? Was he the one who bought it from Eshan? She remembered Eshan mentioning that he was going to sell the painting, but he never mentioned the buyer's name. The realization hit her like a ton of bricks. Arjun was the buyer. But why didn't Eshan tell her it was Arjun? He knew Arjun. A pang of guilt washed over her. Did Arjun buy the painting as a way to remember her?\n\nArjun turned around, his eyes meeting Mahaira's. He had a soft smile on his face. “You're wondering how I got the painting, aren't you?” he asked, his voice calm. Mahaira nodded, her heart pounding in her chest. “Yes, I bought it from Eshan,” Arjun confessed, his gaze steady. Mahaira felt a lump in her throat. She had so many questions. How did Arjun get Eshan's contact? She had never told him anything else except that Eshan was her boyfriend.\n\n“But why?” Mahaira managed to ask, her voice barely above a whisper. Arjun sighed, running a hand through his hair. “When I read the note you left after returning from the office, I felt... I don't know... a sense of loss, I guess,” he admitted, his voice filled with emotion. “That was the first thing I did - I called Eshan and made a deal,” Arjun continued, his eyes never leaving the painting.\n\n“I mean, I wasn't expecting this turn of events,” Arjun chuckled nervously, looking at Mahaira with a mix of emotions. “To be honest, when you first told me about Eshan, I couldn't help but feel a pang of jealousy and I took matters into my own hands. I had one of my guys keep an eye on him, you know, just to make sure nothing suspicious was going on. He used to give me all the information about Eshan and his life.”\n\nHe paused for a moment, taking a deep breath before continuing. “And then, when I read your note... well, let's just say I was caught off guard. I had assumed that after spending a whole year with me, you would have moved on from him. But I guess I underestimated the power of old memories. And I realized that I couldn't let you go that easily.”\n\nArjun shook his head, a wry smile playing on his lips. “Anyway, I saw an opportunity and I took it. I contacted Eshan and struck a deal. I was going to buy the painting.” Arjun paused for a while. “... and you. I offered him a large sum of money for both the painting and his agreement to stay away from you.”\n\nHe looked at Mahaira intently, trying to gauge her reaction. “Honestly, I'm still surprised that he went along with it. I thought he loved you deeply. But here we are.”\n\nArjun's words hung in the air like a challenge, a dare for Mahaira to respond. She felt her heart racing, her mind reeling with the implications of what he had just said. She couldn't believe that Arjun had gone to such lengths to keep her, to own her. The thought made her feel sick, trapped.\n\n“You paid a lot of money for the painting and a contract?” Mahaira asked, her voice laced with disbelief. “You bought me? Like I'm some kind of object you could just purchase?”\n\nMahaira was angry. She had expected this, but she couldn't believe that Arjun had gone to such lengths to keep her. She had never expected him to be so possessive, so controlling. She felt a bitter taste in her mouth, a sense of disgust at the lengths Arjun had gone to secure her for himself.\n\n“But then, Arjun was right,” she thought to herself, her mind racing. She hadn't expected Eshan to choose money over her, to lie to her. She had thought that Eshan loved her, that he cared for her. But now, she wasn't so sure. Did Eshan really love her, or was he just using her?\n\nMahaira sighed, feeling trapped. She didn't know what to do. Part of her wanted to leave Arjun and never look back, but another part of her was grateful to him for showing her the truth about Eshan. She had always thought that Eshan was the love of her life, but now she wasn't so sure.\n\nAnd yet, despite everything, she couldn't help but feel a sense of respect for Arjun. He had been honest with her, he had shown her the true face of Eshan. He had done something terrible, something unforgivable, but he had done it for her. He had done it to protect her, to keep her safe.\n\n“I don't know what to say, Arjun,” Mahaira said, her voice barely above a whisper. “I'm angry, but I'm also grateful. I don't know what to do.”\n\nArjun stepped closer to her, his eyes softening. “I know, Mahaira. I understand. But I want you to know that I'm not trying to control you. I just want you to be happy. And if that means being with me, then so be it. But if you want to leave, I won't stop you. I promise.”\n\nMahaira gazed at the sky, watching as it turned from a clear blue to a stormy grey. The unexpected rain was a fitting metaphor for the turn her life had taken. Arjun's actions were still hard to reconcile - was it love or possession that drove him? She had only ever trusted one man before, and look where that had led her. But maybe, just maybe, she could learn to trust again.\n\nShe turned to look at Arjun, standing quietly beside her. His gaze held a depth of emotion that made her heart race. Was it fear or excitement that she felt? She took a deep breath, letting the cool air fill her lungs.\n\n“Come on,” she said softly, taking his hand. “Let's get wet.”\n\nTogether they walked out into the drizzle. As the rain started to pour, Mahaira felt a sense of cleansing. It was as if the rain was washing away the painful memories of Eshan, the colors he had painted in her heart that she had come to loathe. In their place, she could feel something new, something bright. Mahaira couldn't deny the pull she felt towards Arjun. There was something comforting about his presence, something steady and strong. Could she risk her heart again, even if there was a chance it might be broken once more? Only time would tell. For now, she would take things one step at a time, savoring each moment as it came.\n\n\n\nNot to be continued, maybe...\n\n\n#turmoil #return #surprise #guilt #revelation #trust #rain","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/art-deception-4-end-sun-began-rise-world-around-mahaira-come-cswpkx","p":"csv1su","n":"csx6m1"}