{"d":"2024-02-18T18:42:24Z","t":"A Friend in Deed  3 (end)\n\n\nThe clock had already struck past midday. Kairav was jolted awake by the shrill ring of his phone. It was Neha. He picked up the call, his heart pounding in his chest. “Neha?” he answered, his voice groggy with sleep.\n\n                                                   cont...","c":"#a_friend_in_deed  3 (end)\n\nThe clock had already struck past midday. Kairav was jolted awake by the shrill ring of his phone. It was Neha. He picked up the call, his heart pounding in his chest. “Neha?” he answered, his voice groggy with sleep.\n\n“Kairav, where are you?” Neha's voice came through the phone.\n\n“I...I was sleeping,” Kairav replied, rubbing his eyes.\n\n“Sleeping? Kairav, have you seen the time? You need to get up, get ready, and reach the venue quickly. If you don't, I swear I won't ever talk to you again,” Neha warned him, her voice stern.\n\nKairav could only nod, even though he knew Neha couldn't see him. “Okay, Neha. I'll be there,” he whispered.\n\nWith a heavy heart, Kairav got up from his bed. After a long, sleepless night, he had only managed to fall asleep in the early morning. But now, he had to get ready. He had to see Neha. He had to be there for her, even if it was the last time.\n\nHe made his way to the bathroom to freshen up. As he stood under the shower, he let his tears flow freely, mixing with the water that cascaded down his face. He dressed up in the outfit that Neha had gifted him. His roommate, seeing him all dressed up, joked, “Off to your girlfriend's wedding, are you?” Kairav could only manage a weak smile. Life indeed was strange.\n\nAfter a difficult bus ride, he finally reached the venue, around an hour after Neha's call. The place was as beautiful as its name suggested, decorated with trees and flowers. Kairav didn't have an invitation card, so if anyone asked, he decided to introduce himself as Neha's friend.\n\nHe roamed around the venue, taking in the beautiful decorations. The golden and white drapes added a touch of elegance to the place. There were two thrones arranged on an elevated platform for the bride and the groom, still empty, waiting for their occupants. A sign read, 'Wedding of Neha and ...'.\n\nBefore he could finish reading the sign, he heard a familiar voice behind him. “Kairav, you're here!” He turned around and saw Neha standing there, smiling at him. She was wearing a blue lehenga that matched his outfit. They looked like a couple. But were they? Shouldn't the bride be wearing something red?\n\nNeha walked up to him. She looked into his eyes and said, “You look handsome, Kairav. I'm so glad you came.”\n\nKairav could only stammer, “I...you...”\n\nNeha chuckled and said, “Surprised, huh?”\n\nKairav nodded, still speechless.\n\nNeha leaned closer and whispered, “Are you wondering why I'm not dressed as a bride and why I'm talking to you instead of getting married?”\n\nKairav nodded again, feeling his heart race.\n\nNeha smiled and said, “Kairav, you're such an idiot. A pure, innocent idiot. Why didn't you question the fact that the whole building was decorated if it was just my wedding? You know my family are just tenants there, right? This is not my wedding, Kairav. This is the house owner's daughter's wedding. He invited the whole building, including us.”\n\nKairav felt a wave of relief and shock. He managed to ask, “But the name on the sign?”\n\nNeha laughed and said, “You're so clueless, Kairav. You didn't remember my real name, did you? The owner's daughter's name is Neha, not me. My name is Niharika. That's what should be written on the sign, right?”\n\nKairav looked at the sign, then at Neha...Niharika. He tried to say, “That means...” but Neha cut him off. She said, “That means, I'm not getting married, Kairav. I knew you loved me, but you never had the courage to tell me. So, when the opportunity presented itself, I decided to play a little trick on you, to make you confess your feelings. I'm sorry for making you suffer, Kairav. But I also wanted to see your reaction, to surprise you today.”\n\nKairav looked at her, his eyes wide with surprise, “So, you're...you're mine?”\n\nNeha said, “Of course, I'm yours, Kairav. I've always been yours. I've been shaping you and molding you into the person you are today, just the way I like. Why would I go to someone else, when I have you?”\n\nKairav was too happy to speak. He just stood there, looking at Neha, his heart filled with joy.\n\nNeha smiled and said, “You're such a clueless guy. But I love you for that. Come on, let's walk around. People are staring at us. Should I hold your hand, or will you hold mine? Let's show them what a couple we are.”\n\nKairav hesitated, glancing around, “But your family is here, right? What if they see us?”\n\nNeha just smiled at him, “I'm not like you, Kairav. I don't hide my feelings.”\n\nKairav looked at her, puzzled, “What do you mean?”\n\nNeha took his hand in hers, “My family already knows about you, Kairav. They know I have a boyfriend who's a bit shy and introverted. But he has a good heart and will keep me happy all my life.”\n\nKairav just stared at her, his heart pounding in his chest. He could see the love in Neha's eyes. He had been awake all night, wrestling with his feelings, his fears. Now, standing here with Neha, he wondered if he was still asleep and dreaming. But no, this was real. Neha was real. Their love was real.\n\nNeha led him through the crowd to a man holding a glass of wine. “Kairav, meet my father,” she introduced. She turned to her father, “Dad, this is Kairav, my boyfriend.”\n\nHer father shook Kairav's hand, asked him a few general questions, and then went back to his conversation. Neha then took Kairav around, introducing him to the other guests.\n\nAfter a while, Kairav turned to Neha, “Why didn't you tell me everything last night? Why did you make me think you were getting married to someone else?”\n\nNeha looked at him, her eyes twinkling with mischief, “I wanted to, Kairav. But I also wanted to have some fun with you. Do you know how many sleepless nights I've spent, wondering when you would propose to me? It's nothing compared to the one sleepless night you had.”\n\n\nThere was some music and cheering from outside. The groom's procession was entering the venue. Neha leaned closer to Kairav, whispering in his ear, “You see that, Kairav? That's how I want you to come and take me away one day, in a place as beautiful as this.”\n\n\n\n\n\nAnd so they lived #happyending-ly ever after. The end :).\n\n\n#confession #love #surprise #twist #emotion #relationship","f":"i","l":["lov","sto"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/friend-deed-3-end-clock-had-already-struck-past-midday-awake-ctbkai","p":"ctbaon","n":"ctcd7o"}