{"d":"2024-02-29T18:34:18Z","t":"Syntax of Love\n\nBy the second semester, rumors about my programming prowess had spread like a particularly infectious (but totally harmless) computer virus throughout the computer science department. So, when the new academic year rolled around and we finally delved into the glorious realm of coding, guess who became the unofficial campus guru?\n                                                   cont...","c":"By the second semester, rumors about my programming prowess had spread like a particularly infectious (but totally harmless) computer virus throughout the computer science department. So, when the new academic year rolled around and we finally delved into the glorious realm of coding, guess who became the unofficial campus guru? Yep, yours truly. I found myself transformed into the department's unofficial problem-solver. Assignments, labs, you name it - if it involved code, I was the guy to see. Even the professors started pointing students my way, and I was more than happy to lend a hand.\n\nIt wasn't long before whispers of my 'legendary' coding skills reached the ears of some curious juniors. They, wide-eyed and facing their first coding hurdle, sought me out, desperate for enlightenment. Now, my days back then were pretty simple: attend college, head back to my PG, rinse and repeat. Coming from a family where every penny counted, the thought of some extra cash was pretty darn appealing. Plus, I had plenty of free time on my hands, so with a shrug and a “Why not?”, I embarked on my new career as a 'professor'.\n\nNow, let me paint you a picture of my PG room. The owner, in a stroke of what he must have thought was genius, had managed to squeeze three beds into a room that was barely big enough for one, leaving just enough space for a single, determined cockroach to navigate. So, teaching from there was out of the question. Instead, I'd commandeer an empty classroom in college and transform it into my very own coding dojo. Needless to say, a classroom, any classroom, seemed like a much more appealing (and cockroach-free) option.\n\nThat's how, during my third year, I crossed paths with Sheel, a first-year junior with eyes that sparkled brighter than a compiled program running flawlessly. Unlike the usual flock of students who'd approach me with deer-in-headlights expressions, Sheel exuded genuine enthusiasm for coding, peppering me with questions both in and outside my makeshift classroom.\n\nNow, I wouldn't normally offer one-on-one sessions (free time was precious for a student like me), and I might have turned down someone else, but Sheel was different. Maybe it was her enthusiasm for coding, or maybe it was the prospect of having a pretty girl as a study buddy. But let's be honest, it was mostly because I was a helpful guy... surely.\n\nWe would often meet during breaks, and our conversations would range from arrays to algorithms, and sometimes even beyond the realm of coding. We'd talk about everything and nothing, from the latest movie (which, admittedly, I hadn't seen because let's be honest, who has time for movies when you're the coding guru?) to the merits of different noodle brands (a topic I was very well-versed in). There was a stark contrast between us, visually speaking. She, the epitome of youthful fashion with her trendy clothes and colorful accessories, while I, a seasoned third-year, still clung to my uniform of black pants and a white shirt, the 'official programmer attire' as I liked to call it (though that might have been a slight exaggeration). Despite our differences, a connection formed, as unexpected and delightful as a perfectly placed semicolon.\n\nOur routine continued for a year, a comfortable rhythm of coding, coffee and conversations. Fast forward to my fourth year, and I landed an internship at a pretty decent company. The weekend after I broke the news to my students that I'd no longer be their coding sensei, Sheel called me up. “Meet me at the usual spot?” she asked, her voice full of its usual cheerful energy. And I, ever the eager beaver, didn't bother asking why.\n\n'Usual spot' turned out to be anything but. Instead of our empty classroom, she led me on a whirlwind adventure through the bustling streets of Kolkata. We ended up at a massive shopping mall. Sheel, with laser focus, began browsing the men's clothing section, tossing shirts and pants onto an ever-growing pile. And not just any clothes, but clothes in my size.\n\n“Why?” I asked. A mischievous glint appeared in her eyes. “Don't worry,” she winked, “I'll explain later.”\n\nAfter she'd paid for the shopping spree and wandering the mall for what felt like hours and counting the number of steps in an escalator, we hopped on a bus. But when we neared Naba Diganta Park, she suggested we get off there. Now, for those of you who aren't familiar with the area, this park was quite a detour from our original destination. But, like the obedient student I was (roles reversed, eh?), I followed her lead.\n\nAs soon as we hopped off the bus, I turned to Sheel, my eyebrows raised higher than my hopes. “What's the plan, boss?” I asked. Sheel, with a mysterious grin, replied, “Let's take a walk, shall we?”\n\n“Are we walking all the way back home?” I asked, already dreading the blisters. She just rolled her eyes and told me to chill out, as if we were in the Arctic and not under the blazing Kolkata sun.\n\nWe strolled along the footpath, under a canopy of trees. Sheel turned to me, “Can I hold your hand?” she asked. I froze, feeling as awkward as a penguin in a desert.\n\nThere we were, Sheel striding confidently, hand in mine, while a mischievous breeze played with her hair. I wanted to brush those stray strands away, but I held back, my hand twitching like it had a mind of its own.\n\nAfter a while Sheel stopped. “These are for you,” she said, thrusting the shopping bags into my arms.\n\n“Wait, why?” I stammered, completely thrown off guard.\n\n“Because, silly,” she said, her smile widening, “they're gifts!”\n\n“But I can't just take them,” I protested, feeling my cheeks flush.\n\n“Oh? Then I guess you'll just have to...” She trailed off, her eyes twinkling. “Throw them away?”\n\nThrowing away perfectly good clothes, especially after the shopping marathon we'd just endured, seemed like a crime. With a resigned sigh, I held the bags closer.\n\nSheel continued, “Whenever I see you, I feel like I'm looking at a walking advertisement for the prisoners clothing line. Same clothes every day, shoes sporting more cracks than the Belgharia Flyover... it's enough to make a fashionista cry!”\n\nNow, she wasn't wrong. My fashion sense was about as advanced as a caveman's sock collection. But hey, I was smart on the inside, right? That counts for something! But ouch, the ego! I puffed up like a deflated balloon trying to regain its dignity. “So what? Are these pity gifts?”\n\nSheel's eyes widened. “Pity? No way, Professor Grumpy Pants! I just... well,” she stammered, her cheeks turning the same shade as the sunset, “I hear people whisper about your, uh, 'unique' style, and frankly, it annoys me. Besides, knowing your ego the size of Howrah Station, I couldn't just give you a makeover, could I? But hey, since the coding guru is finally venturing into the real world with an internship, I figured it was high time you upgraded your wardrobe from 'programmer' to 'semi-presentable human being'.”\n\nMy heart skipped a beat. This wasn't just about clothes; it was about her caring. She turned away, starting to walk off. I felt a pang of guilt. “Hey, Sheel!” I called out, “I'm sorry!”\n\nShe didn't turn around. “I can't hear you!” she shouted back, her voice fading as she walked away. There she was, leaving. I mustered up all the courage I had, sprinted after her, and grabbed her hand.\n\nSheel stopped in her tracks, her playful smile replaced by a mock frown. “Oh please,” she sighed dramatically, “holding hands is so kindergarten. A true apology requires a hug!” My face flushed the color of a ripe Alphonso mango. “A hug? In public? That's, uh, a bit much, wouldn't you say?”\n\nSheel rolled her eyes. “No one will even notice. Besides,” she leaned in, her voice dropping to a conspiratorial whisper, “I think I might be falling for the guy beneath the programmer uniform.”\n\nNow, this was a new territory for me. I wasn't exactly opposed to the idea - Sheel, with her infectious laughter and eyes that sparkled like the Hooghly River at sunset, had definitely caught my attention. But the idea of a public display of affection made my face flush hotter than a tandoor on high flame. “Wait, what about all the people watching?” I stammered, gesturing clumsily at the nonexistent crowd.\n\nSheel burst out laughing. “People watching? There's no one here except us two and a stray dog, and even he seems more interested in sniffing that discarded samosa than our little drama. Just hug me, will you?”\n\n“But... I... I can't,” I stuttered, feeling my cheeks flush. She just sighed, “Do I need to teach you how to hug too?”\n\nI swallowed hard, “Y...yes.”\n\nAnd then, it happened. I felt a warm feeling spreading from my chest, radiating throughout my body. She felt like a freshly baked loaf of bread, right out of the oven, all soft and warm. I was enveloped in a warm and cozy blanket, feeling all toasty and snug. It was like hugging a giant marshmallow.\n\nI was jolted awake by the sound of my roommate's voice. “Dude, why are you hugging the pillow like that?”\n\n\n\n#coding #collegelife #dream #friendship #humor #passion #romance #tutor","f":"i","l":["hmr","lov"],"h":"https://www.yourquote.in/sherlock-doyle-9qp8/quotes/syntax-love-second-semester-rumors-about-my-programming-had-cten3w","p":"ctc3i1","n":"ctf6gr"}